var data = [
    /*
    {
        s: [{				s ：产物一(可能多产物)
            name: "重氢",	name ：产物名称
            n: 0.01			n ：数量(如果不提供就是1)
        }, {					产物二(可能多产物)
            name: "氢",		name ：产物名称
            n: 0.99			n ：数量(如果不提供就是1)
        }, ],
        m: "分馏塔",		m ：生产设备
        q: [{				q ：需求产物
            name: "氢",		name ：需求产物名称
            n: 1			n ：需求产物数量
        }],
        t: 1,				t ：生产时间(秒)
        noExtra: true,		noExtra : 提供true增产剂只允许加速 (如果不提供就是false)
    },
    */

    {
        s: [{
            name: "铁矿",
            n: 1,
        }],
        q: [],
        m: "采矿机",
        t: 1,
    }, {
        s: [{
            name: "铜矿",
            n: 1,
        }],
        q: [],
        m: "采矿机",
        t: 1,
    }, {
        s: [{
            name: "煤矿",
            n: 1,
        }],
        q: [],
        m: "采矿机",
        t: 1,
    }, {
        s: [{
            name: "石矿",
            n: 1,
        }],
        q: [],
        m: "采矿机",
        t: 1,
    }, {
        s: [{
            name: "钛石",
            n: 1,
        }],
        q: [],
        m: "采矿机",
        t: 1,
    }, {
        s: [{
            name: "原油",
            n: 1,
        }],
        q: [],
        m: "原油萃取站",
        t: 1,
    }, {
        s: [{
            name: "硅石",
            n: 1,
        }],
        q: [],
        m: "采矿机",
        t: 1,
    }, {
        s: [{
            name: "可燃冰",
            n: 1,
        }],
        m: "采矿机",
        q: [],
        t: 1,
    }, {
        s: [{
            name: "刺笋结晶",
            n: 1,
        }],
        m: "采矿机",
        q: [],
        t: 1,
    }, {
        s: [{
            name: "有机晶体",
            n: 1,
        }],
        m: "采矿机",
        q: [],
        t: 1,
    }, {
        s: [{
            name: "光栅石",
            n: 1,
        }],
        q: [],
        m: "采矿机",
        t: 1,
    }, {
        s: [{
            name: "金伯利矿石",
            n: 1,
        }],
        q: [],
        m: "采矿机",
        t: 1,
    }, {
        s: [{
            name: "分形硅石",
            n: 1,
        }],
        q: [],
        m: "采矿机",
        t: 1,
    }, {
        s: [{
            name: "钨矿",
            n: 1,
        }],
        q: [],
        m: "采矿机",
        t: 1,
    }, {
        s: [{
            name: "氢",
            n: 1,
        }],
        m: "轨道采集器",
        q: [],
        t: 1,
        noExtra: true,
    }, {
        s: [{
            name: "可燃冰",
            n: 1,
        }],
        m: "轨道采集器",
        q: [],
        t: 1,
    }, {
        s: [{
            name: "氨",
            n: 1,
        }],
        m: "轨道采集器",
        q: [],
        t: 1,
    }, {
        s: [{
            name: "氢",
            n: 1,
        }],
        m: "轨道采集器2",
        q: [],
        t: 1,
    }, {
        s: [{
            name: "重氢",
            n: 1,
        }],
        m: "轨道采集器2",
        q: [],
        t: 1,
        noExtra: true,
    }, {
        s: [{
            name: "氦",
            n: 1,
        }],
        m: "轨道采集器2",
        q: [],
        t: 1,
        noExtra: true,
    }, {
        s: [{
            name: "氮",
            n: 1,
        }],
        m: "轨道采集器3",
        q: [],
        t: 1,
        noExtra: true,
    }, {
        s: [{
            name: "氧",
            n: 1,
        }],
        m: "轨道采集器3",
        q: [],
        t: 1,
        noExtra: true,
    }, {
        s: [{
            name: "一氧化碳",
            n: 1,
        }],
        m: "轨道采集器3",
        q: [],
        t: 1,
        noExtra: true,
    }, {
        s: [{
            name: "二氧化碳",
            n: 1,
        }],
        m: "轨道采集器3",
        q: [],
        t: 1,
        noExtra: true,
    }, {
        s: [{
            name: "水",
            n: 100,
        }],
        q: [],
        m: "抽水设施",
        t: 60,
    }, {
        s: [{
            name: "硝酸",
            n: 100
        }],
        m: "抽水设施",
        q: [],
        t: 60,
    }, {
        s: [{
            name: "剧毒液体",
            n: 100
        }],
        m: "抽水设施",
        q: [],
        t: 60,
    }, {
        s: [{
            name: "盐水",
            n: 100
        }],
        m: "抽水设施",
        q: [],
        t: 60,
    }, {
        s: [{
            name: "临界光子",
            n: 1
        }],
        m: "射线接收站",
        q: [],
        t: 10,
    }, {
        s: [{
            name: "临界光子",
            n: 1
        }],
        m: "射线接收站",
        q: [{
            name: "引力透镜",
            n: 0.008333
        }],
        t: 5,
        noExtra: true,
    }, {
        s: [{
            name: "蓄电器（满）",
            n: 1
        }],
        m: "能量枢纽",
        q: [{
            name: "蓄电器",
            n: 1
        }],
        t: 4.5,
    }, {
        s: [{
            name: "铁块",
            n: 2
        },],
        q: [{
            name: "铁矿",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
    }, {
        s: [{
            name: "铜线圈",
            n: 2
        },],
        q: [{
            name: "铜块",
            n: 4
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "铜块",
            n: 2
        },],
        q: [{
            name: "铜矿",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
    }, {
        s: [{
            name: "石材",
            n: 2
        },],
        q: [{
            name: "石矿",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
    }, {
        s: [{
            name: "齿轮",
            n: 2
        },],
        q: [{
            name: "铁块",
            n: 2
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "电路板",
            n: 4
        },],
        q: [{
            name: "铁块",
            n: 2
        }, {
            name: "铜块",
            n: 2
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "风力涡轮机",
            n: 1
        },],
        q: [{
            name: "铁块",
            n: 4
        }, {
            name: "电动机",
            n: 1
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "电力感应塔",
            n: 2
        },],
        q: [{
            name: "铁块",
            n: 2
        }, {
            name: "铜线圈",
            n: 2
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "电磁矩阵",
            n: 1
        },],
        q: [{
            name: "铜线圈",
            n: 1
        }, {
            name: "电路板",
            n: 1
        },],
        t: 3,
        m: "科研设备",
    }, {
        s: [{
            name: "矩阵研究站",
            n: 1
        },],
        q: [{
            name: "基础机械组件",
            n: 1
        }, {
            name: "铁块",
            n: 4
        }, {
            name: "玻璃",
            n: 2
        }, {
            name: "电路板",
            n: 2
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "先驱者晶片",
            n: 1
        },],
        q: [{
            name: "三元精金",
            n: 40
        }, {
            name: "光子结晶",
            n: 20
        }, {
            name: "湿件主机",
            n: 10
        },],
        t: 90,
        m: "精密制造厂",
    }, {
        s: [{
            name: "电浆激发器",
            n: 1
        },],
        q: [{
            name: "玻璃",
            n: 1
        }, {
            name: "铜线圈",
            n: 2
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "无线输电塔",
            n: 1
        },],
        q: [{
            name: "电力感应塔",
            n: 1
        }, {
            name: "电浆激发器",
            n: 1
        },],
        t: 3,
        m: "制造台",
    }, {
        s: [{
            name: "原油萃取站",
            n: 1
        },],
        q: [{
            name: "基础机械组件",
            n: 4
        }, {
            name: "钢材",
            n: 12
        }, {
            name: "电浆激发器",
            n: 4
        }, {
            name: "电路板",
            n: 4
        },],
        t: 4,
        m: "制造台",
    }, {
        s: [{
            name: "精炼厂",
            n: 1
        },],
        q: [{
            name: "基础机械组件",
            n: 4
        }, {
            name: "钢材",
            n: 6
        }, {
            name: "电浆激发器",
            n: 4
        }, {
            name: "电路板",
            n: 2
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "氢",
            n: 2
        }, {
            name: "煤焦油",
            n: 1
        },],
        q: [{
            name: "原油",
            n: 2
        },],
        t: 2,
        m: "精炼设备",
    }, {
        s: [{
            name: "高能石墨",
            n: 2
        },],
        q: [{
            name: "煤矿",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
    }, {
        s: [{
            name: "能量矩阵",
            n: 1
        },],
        q: [{
            name: "高能石墨",
            n: 1
        }, {
            name: "氢",
            n: 1
        },],
        t: 3,
        m: "科研设备",
    }, {
        s: [{
            name: "氢燃料棒",
            n: 1
        },],
        q: [{
            name: "空燃料棒",
            n: 1
        }, {
            name: "氢燃料",
            n: 1
        }, {
            name: "氧",
            n: 10
        },],
        t: 10,
        m: "制造台",
    }, {
        s: [{
            name: "推进器",
            n: 1
        },],
        q: [{
            name: "钢材",
            n: 1
        }, {
            name: "电磁涡轮",
            n: 1
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "加力推进器",
            n: 1
        },],
        q: [{
            name: "推进器",
            n: 2
        }, {
            name: "钛合金",
            n: 1
        }, {
            name: "超级磁场环",
            n: 1
        },],
        t: 4,
        m: "制造台",
    }, {
        s: [{
            name: "化工厂",
            n: 1
        },],
        q: [{
            name: "基础机械组件",
            n: 2
        }, {
            name: "铁块",
            n: 4
        }, {
            name: "玻璃",
            n: 4
        }, {
            name: "电路板",
            n: 2
        },],
        t: 4,
        m: "制造台",
    }, {
        s: [{
            name: "聚乙烯",
            n: 1
        },],
        q: [{
            name: "乙烯",
            n: 2
        }, {
            name: "氧",
            n: 2
        },],
        t: 2,
        m: "化工设备",
    }, {
        s: [{
            name: "硫酸",
            n: 2
        }, {
            name: "氢氧化钠",
            n: 4
        },],
        q: [{
            name: "硫酸钠",
            n: 2
        }, {
            name: "水",
            n: 4
        },],
        t: 2,
        m: "化工设备",
    }, {
        s: [{
            name: "精密制造厂",
            n: 1
        },],
        q: [{
            name: "高精度装配线",
            n: 60
        }, {
            name: "极速传送带",
            n: 240
        }, {
            name: "钨复合金属",
            n: 120
        }, {
            name: "超生物计算集群",
            n: 60
        },],
        t: 180,
        m: "高精度装配线",
    }, {
        s: [{
            name: "紧凑式回旋加速器",
            n: 1
        },],
        q: [{
            name: "微型粒子对撞机",
            n: 40
        }, {
            name: "框架材料",
            n: 240
        }, {
            name: "超级磁场环",
            n: 120
        }, {
            name: "湿件主机",
            n: 5
        },],
        t: 180,
        m: "高精度装配线",
    }, {
        s: [{
            name: "结构矩阵",
            n: 1
        },],
        q: [{
            name: "钛块",
            n: 1
        }, {
            name: "晶格硅",
            n: 1
        },],
        t: 3,
        m: "科研设备",
    }, {
        s: [{
            name: "卡西米尔晶体",
            n: 1
        },],
        q: [{
            name: "超级磁场环",
            n: 1
        }, {
            name: "石墨烯",
            n: 1
        }, {
            name: "氢",
            n: 2
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "物质裂解塔",
            n: 1
        },],
        q: [{
            name: "先进机械组件",
            n: 60
        }, {
            name: "钛合金",
            n: 180
        }, {
            name: "混凝土",
            n: 240
        }, {
            name: "位面熔炉",
            n: 10
        }, {
            name: "量子芯片",
            n: 60
        },],
        t: 300,
        m: "高精度装配线",
    }, {
        s: [{
            name: "钛化玻璃",
            n: 1
        },],
        q: [{
            name: "玻璃",
            n: 2
        }, {
            name: "钛块",
            n: 1
        },],
        t: 4,
        m: "制造台",
    }, {
        s: [{
            name: "石墨烯",
            n: 2
        },],
        q: [{
            name: "高能石墨",
            n: 4
        }, {
            name: "硫酸",
            n: 1
        },],
        t: 2,
        m: "化工设备",
    }, {
        s: [{
            name: "石墨烯",
            n: 2
        }, {
            name: "氢",
            n: 1
        },],
        q: [{
            name: "可燃冰",
            n: 2
        },],
        t: 2,
        m: "化工设备",
    }, {
        s: [{
            name: "碳纳米管",
            n: 2
        },],
        q: [{
            name: "石墨烯",
            n: 4
        },],
        t: 2,
        m: "化工设备",
    }, {
        s: [{
            name: "硅石",
            n: 2
        },],
        q: [{
            name: "石矿",
            n: 4
        },],
        t: 2,
        m: "冶炼设备",
    }, {
        s: [{
            name: "碳纳米管",
            n: 4
        },],
        q: [{
            name: "刺笋结晶",
            n: 2
        },],
        t: 2,
        m: "化工设备",
    }, {
        s: [{
            name: "粒子宽带",
            n: 1
        },],
        q: [{
            name: "碳纳米管",
            n: 1
        }, {
            name: "钛化玻璃",
            n: 1
        },],
        t: 4,
        m: "高精度装配线",
    }, {
        s: [{
            name: "晶格硅",
            n: 1
        },],
        q: [{
            name: "高纯硅块",
            n: 1
        },],
        t: 2,
        m: "冶炼设备",
    }, {
        s: [{
            name: "位面过滤器",
            n: 1
        },],
        q: [{
            name: "卡西米尔晶体",
            n: 1
        }, {
            name: "钛化玻璃",
            n: 2
        },],
        t: 6,
        m: "高精度装配线",
    }, {
        s: [{
            name: "微型粒子对撞机",
            n: 1
        },],
        q: [{
            name: "先进机械组件",
            n: 10
        }, {
            name: "钛合金",
            n: 20
        }, {
            name: "超级磁场环",
            n: 20
        }, {
            name: "量子芯片",
            n: 5
        },],
        t: 10,
        m: "高精度装配线",
    }, {
        s: [{
            name: "重氢",
            n: 2
        },],
        q: [{
            name: "氢",
            n: 4
        },],
        t: 2,
        m: "粒子对撞机",
        noExtra: true,
    }, {
        s: [{
            name: "氘核燃料棒",
            n: 1
        },],
        q: [{
            name: "空燃料棒",
            n: 1
        }, {
            name: "氘核燃料",
            n: 1
        },],
        t: 10,
        m: "制造台",
    }, {
        s: [{
            name: "湮灭约束球",
            n: 1
        },],
        q: [{
            name: "三元精金",
            n: 20
        }, {
            name: "反物质约束单元",
            n: 12
        }, {
            name: "超生物计算集群",
            n: 4
        },],
        t: 60,
        m: "精密制造厂",
    }, {
        s: [{
            name: "人造恒星",
            n: 1
        },],
        q: [{
            name: "尖端机械组件",
            n: 40
        }, {
            name: "钨复合金属",
            n: 60
        }, {
            name: "氦闪约束器",
            n: 16
        }, {
            name: "超级纳米电脑",
            n: 1
        },],
        t: 30,
        m: "高精度装配线",
    }, {
        s: [{
            name: "反物质燃料棒",
            n: 1
        },],
        q: [{
            name: "空燃料棒",
            n: 1
        }, {
            name: "反物质燃料",
            n: 1
        },],
        t: 10,
        m: "制造台",
        noExtra: true,
    }, {
        s: [{
            name: "制造台",
            n: 2
        },],
        q: [{
            name: "基础机械组件",
            n: 2
        }, {
            name: "分拣器",
            n: 2
        }, {
            name: "电路板",
            n: 2
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "电路蚀刻机",
            n: 1
        },],
        q: [{
            name: "基础机械组件",
            n: 1
        }, {
            name: "玻璃",
            n: 1
        }, {
            name: "电路板",
            n: 1
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "高精度装配线",
            n: 1
        },],
        q: [{
            name: "先进机械组件",
            n: 6
        }, {
            name: "钛合金",
            n: 10
        }, {
            name: "极速分拣器",
            n: 12
        }, {
            name: "处理器",
            n: 6
        },],
        t: 6,
        m: "制造台",
    }, {
        s: [{
            name: "采矿机",
            n: 1
        },],
        q: [{
            name: "基础机械组件",
            n: 1
        }, {
            name: "铁块",
            n: 2
        }, {
            name: "齿轮",
            n: 2
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "抽水机",
            n: 1
        },],
        q: [{
            name: "基础机械组件",
            n: 2
        }, {
            name: "铁块",
            n: 4
        }, {
            name: "电动机",
            n: 2
        },],
        t: 4,
        m: "制造台",
    }, {
        s: [{
            name: "玻璃",
            n: 1
        },],
        q: [{
            name: "石矿",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
    }, {
        s: [{
            name: "处理器",
            n: 1
        },],
        q: [{
            name: "覆层塑料基板",
            n: 2
        }, {
            name: "微晶元件",
            n: 2
        }, {
            name: "低功率IC晶片",
            n: 2
        },],
        t: 4,
        m: "制造台",
    }, {
        s: [{
            name: "量子芯片",
            n: 1
        },],
        q: [{
            name: "钛蚀刻覆层塑料基板",
            n: 2
        }, {
            name: "处理器",
            n: 2
        }, {
            name: "标准功率IC晶片",
            n: 2
        },],
        t: 6,
        m: "高精度装配线",
    }, {
        s: [{
            name: "微晶元件",
            n: 1
        },],
        q: [{
            name: "塑料基板",
            n: 2
        }, {
            name: "电路板",
            n: 2
        }, {
            name: "超低功率IC晶片",
            n: 2
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "巨型化学反应釜",
            n: 1
        },],
        q: [{
            name: "先进机械组件",
            n: 60
        }, {
            name: "钛合金",
            n: 180
        }, {
            name: "混凝土",
            n: 240
        }, {
            name: "先进化学反应釜",
            n: 10
        }, {
            name: "量子芯片",
            n: 60
        },],
        t: 300,
        m: "高精度装配线",
    }, {
        s: [{
            name: "信息矩阵",
            n: 1
        },],
        q: [{
            name: "卡西米尔晶体",
            n: 1
        }, {
            name: "粒子宽带",
            n: 1
        },],
        t: 3,
        m: "科研设备",
    }, {
        s: [{
            name: "电弧熔炉",
            n: 1
        },],
        q: [{
            name: "基础机械组件",
            n: 1
        }, {
            name: "铁块",
            n: 2
        }, {
            name: "铜线圈",
            n: 2
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "三元精金",
            n: 1
        },],
        q: [{
            name: "钢材",
            n: 10
        }, {
            name: "钛合金",
            n: 10
        }, {
            name: "钨复合金属",
            n: 10
        },],
        t: 60,
        m: "紧凑式回旋加速器",
    }, {
        s: [{
            name: "高纯硅块",
            n: 2
        },],
        q: [{
            name: "硅石",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
    }, {
        s: [{
            name: "金刚石",
            n: 1
        },],
        q: [{
            name: "高能石墨",
            n: 1
        },],
        t: 2,
        m: "冶炼设备",
    }, {
        s: [{
            name: "金刚石",
            n: 4
        },],
        q: [{
            name: "金伯利矿石",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
    }, {
        s: [{
            name: "晶格硅",
            n: 4
        },],
        q: [{
            name: "分形硅石",
            n: 2
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "钢材",
            n: 1
        },],
        q: [{
            name: "铁块",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
    }, {
        s: [{
            name: "火力发电厂",
            n: 1
        },],
        q: [{
            name: "钢材",
            n: 10
        }, {
            name: "石材",
            n: 10
        }, {
            name: "电动机",
            n: 4
        }, {
            name: "电路板",
            n: 4
        },],
        t: 4,
        m: "制造台",
    }, {
        s: [{
            name: "钛块",
            n: 2
        },],
        q: [{
            name: "钛石",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
    }, {
        s: [{
            name: "钛合金",
            n: 4
        },],
        q: [{
            name: "钢材",
            n: 4
        }, {
            name: "钛块",
            n: 4
        },],
        t: 6,
        m: "冶炼设备",
    }, {
        s: [{
            name: "太阳能板",
            n: 1
        },],
        q: [{
            name: "铁块",
            n: 4
        }, {
            name: "高纯硅块",
            n: 2
        }, {
            name: "电路板",
            n: 1
        },],
        t: 4,
        m: "制造台",
    }, {
        s: [{
            name: "精密结构组装厂",
            n: 1
        },],
        q: [{
            name: "尖端机械组件",
            n: 30
        }, {
            name: "钨复合金属",
            n: 60
        }, {
            name: "混凝土",
            n: 360
        }, {
            name: "高精度装配线",
            n: 20
        }, {
            name: "量子芯片",
            n: 120
        },],
        t: 300,
        m: "高精度装配线",
    }, {
        s: [{
            name: "物质分解设施",
            n: 1
        },],
        q: [{
            name: "先进机械组件",
            n: 20
        }, {
            name: "钛合金",
            n: 60
        }, {
            name: "混凝土",
            n: 40
        }, {
            name: "矿物处理厂",
            n: 20
        }, {
            name: "量子芯片",
            n: 10
        },],
        t: 120,
        m: "高精度装配线",
    }, {
        s: [{
            name: "太阳帆",
            n: 6
        },],
        q: [{
            name: "聚苯并咪唑",
            n: 1
        }, {
            name: "处理器",
            n: 1
        },],
        t: 2,
        m: "高精度装配线",
    }, {
        s: [{
            name: "电磁轨道弹射器",
            n: 1
        },],
        q: [{
            name: "尖端机械组件",
            n: 20
        }, {
            name: "钨复合金属",
            n: 40
        }, {
            name: "超级磁场环",
            n: 20
        }, {
            name: "超级纳米电脑",
            n: 2
        },],
        t: 6,
        m: "高精度装配线",
    }, {
        s: [{
            name: "射线接收站",
            n: 1
        },],
        q: [{
            name: "尖端机械组件",
            n: 2
        }, {
            name: "钨复合金属",
            n: 10
        }, {
            name: "太阳帆",
            n: 6
        }, {
            name: "量子芯片",
            n: 2
        },],
        t: 6,
        m: "高精度装配线",
    }, {
        s: [{
            name: "广播式能源塔",
            n: 1
        },],
        q: [{
            name: "三元精金",
            n: 120
        }, {
            name: "尖端机械组件",
            n: 60
        }, {
            name: "光子结晶",
            n: 60
        }, {
            name: "先驱者晶片",
            n: 4
        },],
        t: 180,
        m: "精密制造厂",
    }, {
        s: [{
            name: "反物质",
            n: 2
        }, {
            name: "氢",
            n: 2
        },],
        q: [{
            name: "临界光子",
            n: 2
        },],
        t: 2,
        m: "粒子对撞机",
        noExtra: true,
    }, {
        s: [{
            name: "宇宙矩阵",
            n: 1
        },],
        q: [{
            name: "宇宙矩阵粗坯",
            n: 1
        }, {
            name: "反物质",
            n: 1
        },],
        t: 3,
        m: "科研设备",
    }, {
        s: [{
            name: "蓄电器",
            n: 1
        },],
        q: [{
            name: "铁块",
            n: 4
        }, {
            name: "晶格硅",
            n: 2
        }, {
            name: "电路板",
            n: 1
        },],
        t: 4,
        m: "制造台",
    }, {
        s: [{
            name: "能量枢纽",
            n: 1
        },],
        q: [{
            name: "先进机械组件",
            n: 4
        }, {
            name: "混凝土",
            n: 16
        }, {
            name: "处理器",
            n: 4
        },],
        t: 6,
        m: "制造台",
    }, {
        s: [{
            name: "空间翘曲器",
            n: 1
        },],
        q: [{
            name: "引力透镜",
            n: 1
        },],
        t: 10,
        m: "制造台",
    }, {
        s: [{
            name: "空间翘曲器",
            n: 8
        },],
        q: [{
            name: "引力矩阵",
            n: 1
        },],
        t: 10,
        m: "制造台",
    }, {
        s: [{
            name: "框架材料",
            n: 1
        },],
        q: [{
            name: "钨复合金属",
            n: 1
        }, {
            name: "聚苯并咪唑",
            n: 1
        },],
        t: 4,
        m: "制造台",
    }, {
        s: [{
            name: "戴森球组件",
            n: 1
        },],
        q: [{
            name: "框架材料",
            n: 1
        }, {
            name: "太阳帆",
            n: 1
        },],
        t: 6,
        m: "制造台",
    }, {
        s: [{
            name: "垂直发射井",
            n: 1
        },],
        q: [{
            name: "尖端机械组件",
            n: 20
        }, {
            name: "钨复合金属",
            n: 40
        }, {
            name: "钨强化玻璃",
            n: 20
        }, {
            name: "超级纳米电脑",
            n: 8
        },],
        t: 15,
        m: "高精度装配线",
    }, {
        s: [{
            name: "小型运载火箭",
            n: 1
        },],
        q: [{
            name: "戴森球组件",
            n: 4
        }, {
            name: "量子芯片",
            n: 1
        }, {
            name: "加力推进器",
            n: 2
        },],
        t: 10,
        m: "高精度装配线",
    }, {
        s: [{
            name: "传送带",
            n: 6
        },],
        q: [{
            name: "铁块",
            n: 2
        }, {
            name: "电动机",
            n: 2
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "分拣器",
            n: 2
        },],
        q: [{
            name: "铁块",
            n: 2
        }, {
            name: "电动机",
            n: 2
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "小型储物仓",
            n: 1
        },],
        q: [{
            name: "铁块",
            n: 2
        }, {
            name: "石材",
            n: 2
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "四向分流器",
            n: 1
        },],
        q: [{
            name: "铁块",
            n: 1
        }, {
            name: "传送带",
            n: 1
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "高速分拣器",
            n: 4
        },],
        q: [{
            name: "分拣器",
            n: 4
        }, {
            name: "电磁涡轮",
            n: 2
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "高速传送带",
            n: 6
        },],
        q: [{
            name: "传送带",
            n: 6
        }, {
            name: "电磁涡轮",
            n: 2
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "极速分拣器",
            n: 4
        },],
        q: [{
            name: "高速分拣器",
            n: 4
        }, {
            name: "超级磁场环",
            n: 2
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "大型储物仓",
            n: 1
        },],
        q: [{
            name: "铁块",
            n: 4
        }, {
            name: "石材",
            n: 4
        },],
        t: 4,
        m: "制造台",
    }, {
        s: [{
            name: "极速传送带",
            n: 6
        },],
        q: [{
            name: "高速传送带",
            n: 6
        }, {
            name: "超级磁场环",
            n: 2
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "物流运输站",
            n: 1
        },],
        q: [{
            name: "基础机械组件",
            n: 10
        }, {
            name: "钢材",
            n: 30
        }, {
            name: "混凝土",
            n: 20
        }, {
            name: "微晶元件",
            n: 5
        },],
        t: 15,
        m: "制造台",
    }, {
        s: [{
            name: "物流运输机",
            n: 1
        },],
        q: [{
            name: "铁块",
            n: 4
        }, {
            name: "推进器",
            n: 2
        },],
        t: 10,
        m: "制造台",
    }, {
        s: [{
            name: "星际物流运输站",
            n: 1
        },],
        q: [{
            name: "先进机械组件",
            n: 20
        }, {
            name: "钛合金",
            n: 60
        }, {
            name: "混凝土",
            n: 40
        }, {
            name: "处理器",
            n: 2
        },],
        t: 30,
        m: "制造台",
    }, {
        s: [{
            name: "星际物流运输船",
            n: 1
        },],
        q: [{
            name: "钛合金",
            n: 8
        }, {
            name: "加力推进器",
            n: 2
        },],
        t: 15,
        m: "制造台",
    }, {
        s: [{
            name: "电动机",
            n: 1
        },],
        q: [{
            name: "铁块",
            n: 1
        }, {
            name: "铜线圈",
            n: 1
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "电磁涡轮",
            n: 1
        },],
        q: [{
            name: "电动机",
            n: 1
        }, {
            name: "石墨线圈",
            n: 1
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "氘氦混合聚变燃料棒",
            n: 1
        },],
        q: [{
            name: "氘核燃料棒",
            n: 1
        }, {
            name: "氦三燃料棒",
            n: 1
        }, {
            name: "氦闪约束器",
            n: 1
        },],
        t: 10,
        m: "制造台",
    }, {
        s: [{
            name: "氦三燃料棒",
            n: 1
        },],
        q: [{
            name: "空燃料棒",
            n: 1
        }, {
            name: "氦三",
            n: 20
        },],
        t: 10,
        m: "制造台",
    }, {
        s: [{
            name: "引力透镜",
            n: 1
        },],
        q: [{
            name: "超级磁场环",
            n: 1
        }, {
            name: "奇异物质",
            n: 1
        },],
        t: 4,
        m: "制造台",
    }, {
        s: [{
            name: "引力矩阵",
            n: 1
        },],
        q: [{
            name: "引力透镜",
            n: 1
        }, {
            name: "位面过滤器",
            n: 1
        },],
        t: 3,
        m: "科研设备",
    }, {
        s: [{
            name: "超级磁场环",
            n: 1
        },],
        q: [{
            name: "电磁涡轮",
            n: 1
        }, {
            name: "钛线圈",
            n: 1
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "奇异物质",
            n: 1
        },],
        q: [{
            name: "卡西米尔晶体",
            n: 1
        }, {
            name: "重氢",
            n: 8
        },],
        t: 6,
        m: "制造台",
    }, {
        s: [{
            name: "氦三",
            n: 1
        },],
        q: [{
            name: "氦",
            n: 4
        },],
        t: 4,
        m: "粒子对撞机",
    }, {
        s: [{
            name: "氦",
            n: 4
        },],
        q: [{
            name: "光栅石",
            n: 2
        },],
        t: 4,
        m: "化工设备",
    }, {
        s: [{
            name: "增产剂",
            n: 1
        },],
        q: [{
            name: "碳纳米管",
            n: 2
        }, {
            name: "三氯化铁",
            n: 1
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "喷涂机",
            n: 1
        },],
        q: [{
            name: "先进机械组件",
            n: 10
        }, {
            name: "混凝土",
            n: 10
        }, {
            name: "钛化玻璃",
            n: 4
        }, {
            name: "量子芯片",
            n: 2
        },],
        t: 4,
        m: "高精度装配线",
    }, {
        s: [{
            name: "反物质能量炉",
            n: 1
        },],
        q: [{
            name: "三元精金",
            n: 240
        }, {
            name: "尖端机械组件",
            n: 120
        }, {
            name: "湮灭约束球",
            n: 120
        }, {
            name: "先驱者晶片",
            n: 8
        },],
        t: 180,
        m: "精密制造厂",
    }, {
        s: [{
            name: "轨道采集器",
            n: 1
        },],
        q: [{
            name: "星际物流运输站",
            n: 1
        }, {
            name: "超级磁场环",
            n: 20
        },],
        t: 30,
        m: "制造台",
    }, {
        s: [{
            name: "地基",
            n: 2
        },],
        q: [{
            name: "石材",
            n: 2
        }, {
            name: "钢材",
            n: 2
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "裂变能源发电站",
            n: 1
        },],
        q: [{
            name: "先进机械组件",
            n: 10
        }, {
            name: "钛合金",
            n: 30
        }, {
            name: "混凝土",
            n: 20
        }, {
            name: "超级磁场环",
            n: 16
        }, {
            name: "量子芯片",
            n: 4
        },],
        t: 10,
        m: "高精度装配线",
    }, {
        s: [{
            name: "储液罐",
            n: 1
        },],
        q: [{
            name: "铁块",
            n: 2
        }, {
            name: "石材",
            n: 2
        }, {
            name: "玻璃",
            n: 2
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "氦闪约束器",
            n: 1
        },],
        q: [{
            name: "钨复合金属",
            n: 8
        }, {
            name: "超级磁场环",
            n: 4
        }, {
            name: "量子芯片",
            n: 1
        },],
        t: 15,
        m: "高精度装配线",
    }, {
        s: [{
            name: "位面熔炉",
            n: 1
        },],
        q: [{
            name: "先进机械组件",
            n: 4
        }, {
            name: "钛合金",
            n: 8
        }, {
            name: "位面过滤器",
            n: 4
        },],
        t: 4,
        m: "高精度装配线",
    }, {
        s: [{
            name: "流速监测器",
            n: 1
        },],
        q: [{
            name: "铁块",
            n: 1
        }, {
            name: "电路板",
            n: 1
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "地热发电站",
            n: 1
        },],
        q: [{
            name: "火力发电厂",
            n: 2
        }, {
            name: "钛合金",
            n: 16
        }, {
            name: "处理器",
            n: 4
        },],
        t: 6,
        m: "制造台",
    }, {
        s: [{
            name: "大型采矿机",
            n: 1
        },],
        q: [{
            name: "尖端机械组件",
            n: 20
        }, {
            name: "钛合金",
            n: 60
        }, {
            name: "钨强化玻璃",
            n: 20
        }, {
            name: "量子芯片",
            n: 10
        },],
        t: 10,
        m: "高精度装配线",
    }, {
        s: [{
            name: "自动集装机",
            n: 1
        },],
        q: [{
            name: "基础机械组件",
            n: 2
        }, {
            name: "传送带",
            n: 2
        }, {
            name: "电路板",
            n: 2
        },],
        t: 4,
        m: "制造台",
    }, {
        s: [{
            name: "反物质约束单元",
            n: 1
        },],
        q: [{
            name: "框架材料",
            n: 8
        }, {
            name: "位面过滤器",
            n: 4
        }, {
            name: "超级磁场环",
            n: 4
        }, {
            name: "量子芯片",
            n: 2
        },],
        t: 30,
        m: "高精度装配线",
    }, {
        s: [{
            name: "物流配送器",
            n: 1
        },],
        q: [{
            name: "基础机械组件",
            n: 1
        }, {
            name: "钢材",
            n: 2
        }, {
            name: "电路板",
            n: 1
        },],
        t: 8,
        m: "制造台",
    }, {
        s: [{
            name: "配送运输机",
            n: 1
        },],
        q: [{
            name: "铁块",
            n: 2
        }, {
            name: "电磁涡轮",
            n: 1
        }, {
            name: "电路板",
            n: 1
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "先进化学反应釜",
            n: 1
        },],
        q: [{
            name: "先进机械组件",
            n: 2
        }, {
            name: "钛化玻璃",
            n: 12
        }, {
            name: "钛合金",
            n: 12
        }, {
            name: "处理器",
            n: 6
        },],
        t: 10,
        m: "制造台",
    }, {
        s: [{
            name: "乙烯",
            n: 3
        }, {
            name: "氯苯",
            n: 2
        }, {
            name: "甘油",
            n: 1
        },],
        q: [{
            name: "原油",
            n: 3
        },],
        t: 6,
        m: "精炼设备",
    }, {
        s: [{
            name: "氢",
            n: 4
        }, {
            name: "氧",
            n: 2
        },],
        q: [{
            name: "水",
            n: 2
        },],
        t: 2,
        m: "化工设备",
    }, {
        s: [{
            name: "氢氧化钠",
            n: 2
        }, {
            name: "氢氯酸",
            n: 2
        },],
        q: [{
            name: "盐水",
            n: 2
        },],
        t: 2,
        m: "化工设备",
    }, {
        s: [{
            name: "氯化钠",
            n: 1
        }, {
            name: "硝酸钠",
            n: 1
        }, {
            name: "硫酸钠",
            n: 1
        },],
        q: [{
            name: "石矿",
            n: 1
        },],
        t: 3,
        m: "制造台",
    }, {
        s: [{
            name: "环氧氯丙烷",
            n: 1
        }, {
            name: "水",
            n: 2
        },],
        q: [{
            name: "甘油",
            n: 1
        }, {
            name: "氢氯酸",
            n: 1
        },],
        t: 2,
        m: "化工设备",
    }, {
        s: [{
            name: "盐水",
            n: 2
        },],
        q: [{
            name: "水",
            n: 2
        }, {
            name: "氯化钠",
            n: 2
        },],
        t: 2,
        m: "化工设备",
    }, {
        s: [{
            name: "双酚A",
            n: 1
        }, {
            name: "水",
            n: 1
        },],
        q: [{
            name: "氢氯酸",
            n: 1
        }, {
            name: "苯酚",
            n: 2
        }, {
            name: "丙酮",
            n: 1
        },],
        t: 2,
        m: "化工设备",
    }, {
        s: [{
            name: "硝酸",
            n: 2
        }, {
            name: "硫酸钠",
            n: 1
        },],
        q: [{
            name: "硝酸钠",
            n: 2
        }, {
            name: "硫酸",
            n: 1
        },],
        t: 2,
        m: "化工设备",
    }, {
        s: [{
            name: "二硝基氯苯",
            n: 2
        },],
        q: [{
            name: "硝酸",
            n: 2
        }, {
            name: "氯苯",
            n: 2
        },],
        t: 2,
        m: "先进化学反应釜",
    }, {
        s: [{
            name: "二氯联苯胺",
            n: 2
        },],
        q: [{
            name: "二硝基氯苯",
            n: 2
        }, {
            name: "铜块",
            n: 2
        },],
        t: 2,
        m: "先进化学反应釜",
    }, {
        s: [{
            name: "氨",
            n: 1
        },],
        q: [{
            name: "氮",
            n: 1
        }, {
            name: "氢",
            n: 3
        },],
        t: 2,
        m: "化工设备",
    }, {
        s: [{
            name: "二氨基联苯胺",
            n: 1
        }, {
            name: "氢氯酸",
            n: 2
        },],
        q: [{
            name: "二氯联苯胺",
            n: 1
        }, {
            name: "氨",
            n: 2
        },],
        t: 2,
        m: "先进化学反应釜",
    }, {
        s: [{
            name: "煤焦油",
            n: 2
        },],
        q: [{
            name: "煤矿",
            n: 2
        },],
        t: 2,
        m: "精炼设备",
    }, {
        s: [{
            name: "苯酚",
            n: 4
        }, {
            name: "二甲苯",
            n: 2
        }, {
            name: "丙酮",
            n: 2
        },],
        q: [{
            name: "煤焦油",
            n: 2
        },],
        t: 2,
        m: "精炼设备",
    }, {
        s: [{
            name: "邻苯二甲酸",
            n: 1
        }, {
            name: "水",
            n: 2
        },],
        q: [{
            name: "氧",
            n: 2
        }, {
            name: "二甲苯",
            n: 1
        },],
        t: 2,
        m: "化工设备",
    }, {
        s: [{
            name: "间苯二甲酸二苯酯",
            n: 2
        },],
        q: [{
            name: "苯酚",
            n: 4
        }, {
            name: "邻苯二甲酸",
            n: 2
        },],
        t: 2,
        m: "先进化学反应釜",
    }, {
        s: [{
            name: "三氯化铁",
            n: 4
        }, {
            name: "水",
            n: 6
        },],
        q: [{
            name: "氢氯酸",
            n: 12
        }, {
            name: "铁块",
            n: 4
        }, {
            name: "氧",
            n: 6
        },],
        t: 6,
        m: "化工设备",
    }, {
        s: [{
            name: "硝酸",
            n: 1
        }, {
            name: "水",
            n: 1
        },],
        q: [{
            name: "氨",
            n: 1
        }, {
            name: "氧",
            n: 4
        },],
        t: 6,
        m: "化工设备",
    }, {
        s: [{
            name: "一氧化碳",
            n: 2
        },],
        q: [{
            name: "二氧化碳",
            n: 1
        }, {
            name: "高能石墨",
            n: 1
        },],
        t: 2,
        m: "化工设备",
    }, {
        s: [{
            name: "原油",
            n: 1
        },],
        q: [{
            name: "二氧化碳",
            n: 12
        }, {
            name: "氢",
            n: 36
        },],
        t: 12,
        m: "化工设备",
    }, {
        s: [{
            name: "甘油",
            n: 1
        },],
        q: [{
            name: "一氧化碳",
            n: 3
        }, {
            name: "氢",
            n: 8
        },],
        t: 2,
        m: "化工设备",
    }, {
        s: [{
            name: "生物微晶元件",
            n: 1
        },],
        q: [{
            name: "生物基板",
            n: 2
        }, {
            name: "微晶元件",
            n: 2
        }, {
            name: "高功率IC晶片",
            n: 2
        },],
        t: 2,
        m: "高精度装配线",
    }, {
        s: [{
            name: "先进生物电路",
            n: 1
        },],
        q: [{
            name: "覆层生物基板",
            n: 2
        }, {
            name: "生物微晶元件",
            n: 2
        }, {
            name: "超高功率IC晶片",
            n: 2
        },],
        t: 4,
        m: "高精度装配线",
    }, {
        s: [{
            name: "超生物计算集群",
            n: 1
        },],
        q: [{
            name: "钨蚀刻覆层生物基板",
            n: 2
        }, {
            name: "先进生物电路",
            n: 2
        }, {
            name: "生物IC晶片",
            n: 2
        },],
        t: 6,
        m: "高精度装配线",
    }, {
        s: [{
            name: "生物神经纤维",
            n: 1
        },],
        q: [{
            name: "粒子宽带",
            n: 2
        }, {
            name: "活性生物纤维",
            n: 2
        }, {
            name: "钨强化玻璃",
            n: 2
        },],
        t: 4,
        m: "高精度装配线",
    }, {
        s: [{
            name: "超级纳米电脑",
            n: 1
        },],
        q: [{
            name: "钛合金",
            n: 50
        }, {
            name: "粒子宽带",
            n: 20
        }, {
            name: "量子芯片",
            n: 20
        },],
        t: 60,
        m: "高精度装配线",
    }, {
        s: [{
            name: "湿件主机",
            n: 1
        },],
        q: [{
            name: "钨复合金属",
            n: 60
        }, {
            name: "生物神经纤维",
            n: 40
        }, {
            name: "超生物计算集群",
            n: 40
        },],
        t: 90,
        m: "高精度装配线",
    }, {
        s: [{
            name: "塑料基板",
            n: 1
        },],
        q: [{
            name: "聚乙烯",
            n: 1
        }, {
            name: "硫酸",
            n: 1
        },],
        t: 2,
        m: "电路蚀刻机",
    }, {
        s: [{
            name: "覆层塑料基板",
            n: 1
        },],
        q: [{
            name: "塑料基板",
            n: 1
        }, {
            name: "环氧树脂",
            n: 2
        }, {
            name: "硫酸",
            n: 1
        },],
        t: 2,
        m: "电路蚀刻机",
    }, {
        s: [{
            name: "钛蚀刻覆层塑料基板",
            n: 1
        },],
        q: [{
            name: "覆层塑料基板",
            n: 1
        }, {
            name: "钛块",
            n: 2
        }, {
            name: "硫酸",
            n: 1
        },],
        t: 2,
        m: "电路蚀刻机",
    }, {
        s: [{
            name: "生物基板",
            n: 1
        },],
        q: [{
            name: "聚苯并咪唑",
            n: 2
        }, {
            name: "三氯化铁",
            n: 2
        },],
        t: 4,
        m: "电路蚀刻机",
    }, {
        s: [{
            name: "覆层生物基板",
            n: 1
        },],
        q: [{
            name: "生物基板",
            n: 1
        }, {
            name: "活性生物纤维",
            n: 2
        }, {
            name: "三氯化铁",
            n: 2
        },],
        t: 4,
        m: "电路蚀刻机",
    }, {
        s: [{
            name: "钨蚀刻覆层生物基板",
            n: 1
        },],
        q: [{
            name: "覆层生物基板",
            n: 1
        }, {
            name: "钨块",
            n: 2
        }, {
            name: "三氯化铁",
            n: 2
        },],
        t: 4,
        m: "电路蚀刻机",
    }, {
        s: [{
            name: "超低功率IC晶片",
            n: 12
        },],
        q: [{
            name: "硅晶圆",
            n: 1
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "低功率IC晶片",
            n: 12
        },],
        q: [{
            name: "硅晶圆",
            n: 1
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "标准功率IC晶片",
            n: 12
        },],
        q: [{
            name: "钛掺杂的硅晶圆",
            n: 1
        },],
        t: 2,
        m: "高精度装配线",
    }, {
        s: [{
            name: "高功率IC晶片",
            n: 12
        },],
        q: [{
            name: "钛掺杂的硅晶圆",
            n: 1
        },],
        t: 2,
        m: "高精度装配线",
    }, {
        s: [{
            name: "超高功率IC晶片",
            n: 12
        },],
        q: [{
            name: "钨掺杂的硅晶圆",
            n: 1
        },],
        t: 2,
        m: "高精度装配线",
    }, {
        s: [{
            name: "生物IC晶片",
            n: 12
        },],
        q: [{
            name: "钨掺杂的硅晶圆",
            n: 1
        },],
        t: 2,
        m: "高精度装配线",
    }, {
        s: [{
            name: "环氧树脂",
            n: 1
        }, {
            name: "盐水",
            n: 1
        },],
        q: [{
            name: "双酚A",
            n: 1
        }, {
            name: "环氧氯丙烷",
            n: 1
        }, {
            name: "氢氧化钠",
            n: 3
        },],
        t: 2,
        m: "化工设备",
    }, {
        s: [{
            name: "聚苯并咪唑",
            n: 1
        }, {
            name: "苯酚",
            n: 1
        },],
        q: [{
            name: "二氨基联苯胺",
            n: 1
        }, {
            name: "间苯二甲酸二苯酯",
            n: 1
        },],
        t: 2,
        m: "先进化学反应釜",
    }, {
        s: [{
            name: "钨矿",
            n: 1
        },],
        q: [{
            name: "钛石",
            n: 6
        }, {
            name: "硝酸",
            n: 2
        },],
        t: 3,
        m: "化工设备",
    }, {
        s: [{
            name: "钨块",
            n: 2
        },],
        q: [{
            name: "钨矿",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
    }, {
        s: [{
            name: "钨强化玻璃",
            n: 1
        },],
        q: [{
            name: "玻璃",
            n: 2
        }, {
            name: "钨块",
            n: 1
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "钨复合金属",
            n: 4
        },],
        q: [{
            name: "钢材",
            n: 2
        }, {
            name: "钛合金",
            n: 4
        }, {
            name: "钨块",
            n: 8
        },],
        t: 12,
        m: "冶炼设备",
    }, {
        s: [{
            name: "硅晶圆",
            n: 1
        },],
        q: [{
            name: "高纯硅块",
            n: 16
        },],
        t: 8,
        m: "冶炼设备",
    }, {
        s: [{
            name: "钛掺杂的硅晶圆",
            n: 2
        },],
        q: [{
            name: "高纯硅块",
            n: 64
        }, {
            name: "钛块",
            n: 16
        },],
        t: 8,
        m: "冶炼设备",
    }, {
        s: [{
            name: "钨掺杂的硅晶圆",
            n: 4
        },],
        q: [{
            name: "高纯硅块",
            n: 128
        }, {
            name: "钨块",
            n: 32
        },],
        t: 8,
        m: "冶炼设备",
    }, {
        s: [{
            name: "活性生物纤维",
            n: 1
        },],
        q: [{
            name: "有机晶体",
            n: 2
        },],
        t: 2,
        m: "化工设备",
    }, {
        s: [{
            name: "钛齿轮",
            n: 2
        },],
        q: [{
            name: "钛块",
            n: 2
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "钨齿轮",
            n: 2
        },],
        q: [{
            name: "钨块",
            n: 2
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "光子结晶",
            n: 1
        },],
        q: [{
            name: "临界光子",
            n: 10
        },],
        t: 60,
        m: "紧凑式回旋加速器",
    }, {
        s: [{
            name: "石墨线圈",
            n: 2
        },],
        q: [{
            name: "高能石墨",
            n: 4
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "钛线圈",
            n: 2
        },],
        q: [{
            name: "钛块",
            n: 4
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "基础机械组件",
            n: 1
        },],
        q: [{
            name: "铁块",
            n: 2
        }, {
            name: "齿轮",
            n: 2
        }, {
            name: "电路板",
            n: 1
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "先进机械组件",
            n: 1
        },],
        q: [{
            name: "基础机械组件",
            n: 2
        }, {
            name: "钛齿轮",
            n: 2
        }, {
            name: "处理器",
            n: 1
        },],
        t: 4,
        m: "制造台",
    }, {
        s: [{
            name: "尖端机械组件",
            n: 1
        },],
        q: [{
            name: "先进机械组件",
            n: 2
        }, {
            name: "钨齿轮",
            n: 2
        }, {
            name: "量子芯片",
            n: 1
        },],
        t: 6,
        m: "高精度装配线",
    }, {
        s: [{
            name: "空燃料棒",
            n: 1
        },],
        q: [{
            name: "铁块",
            n: 1
        }, {
            name: "玻璃",
            n: 1
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "氢燃料",
            n: 1
        },],
        q: [{
            name: "氢",
            n: 12
        },],
        t: 2,
        m: "化工设备",
    }, {
        s: [{
            name: "氘核燃料",
            n: 1
        },],
        q: [{
            name: "重氢",
            n: 6
        },],
        t: 4,
        m: "化工设备",
    }, {
        s: [{
            name: "反物质燃料",
            n: 1
        },],
        q: [{
            name: "反物质",
            n: 6
        },],
        t: 6,
        m: "化工设备",
    }, {
        s: [{
            name: "反物质",
            n: 4
        },],
        q: [{
            name: "临界光子",
            n: 4
        },],
        t: 2,
        m: "粒子对撞机",
        noExtra: true,
    }, {
        s: [{
            name: "奇异物质",
            n: 1
        },],
        q: [{
            name: "金刚石",
            n: 1
        }, {
            name: "重氢",
            n: 4
        },],
        t: 3,
        m: "粒子对撞机",
    }, {
        s: [{
            name: "石墨烯",
            n: 4
        },],
        q: [{
            name: "可燃冰",
            n: 2
        },],
        t: 2,
        m: "化工设备",
    }, {
        s: [{
            name: "氢",
            n: 4
        },],
        q: [{
            name: "原油",
            n: 2
        },],
        t: 2,
        m: "精炼设备",
    }, {
        s: [{
            name: "硫酸",
            n: 1
        }, {
            name: "氨",
            n: 1
        }, {
            name: "氢氯酸",
            n: 1
        }, {
            name: "煤焦油",
            n: 1
        },],
        q: [{
            name: "剧毒液体",
            n: 2
        },],
        t: 2,
        m: "精炼设备",
    }, {
        s: [{
            name: "硅晶圆",
            n: 1
        },],
        q: [{
            name: "高纯硅块",
            n: 8
        }, {
            name: "光栅石",
            n: 4
        },],
        t: 4,
        m: "冶炼设备",
    }, {
        s: [{
            name: "钛掺杂的硅晶圆",
            n: 2
        },],
        q: [{
            name: "高纯硅块",
            n: 32
        }, {
            name: "钛块",
            n: 8
        }, {
            name: "光栅石",
            n: 8
        },],
        t: 4,
        m: "冶炼设备",
    }, {
        s: [{
            name: "钨掺杂的硅晶圆",
            n: 4
        },],
        q: [{
            name: "高纯硅块",
            n: 64
        }, {
            name: "钨块",
            n: 16
        }, {
            name: "光栅石",
            n: 16
        },],
        t: 4,
        m: "冶炼设备",
    }, {
        s: [{
            name: "聚苯并咪唑",
            n: 1
        },],
        q: [{
            name: "活性生物纤维",
            n: 12
        },],
        t: 12,
        m: "精炼设备",
    }, {
        s: [{
            name: "聚乙烯",
            n: 4
        },],
        q: [{
            name: "有机晶体",
            n: 1
        }, {
            name: "乙烯",
            n: 2
        }, {
            name: "氧",
            n: 2
        },],
        t: 2,
        m: "化工设备",
    }, {
        s: [{
            name: "处理器",
            n: 4
        },],
        q: [{
            name: "生物基板",
            n: 1
        }, {
            name: "高功率IC晶片",
            n: 2
        },],
        t: 3,
        m: "高精度装配线",
    }, {
        s: [{
            name: "含硫轻燃油",
            n: 1
        }, {
            name: "含硫重燃油",
            n: 3
        },],
        q: [{
            name: "原油",
            n: 1
        },],
        t: 4,
        m: "精炼设备",
    }, {
        s: [{
            name: "轻燃油",
            n: 2
        }, {
            name: "硫化氢",
            n: 1
        },],
        q: [{
            name: "含硫轻燃油",
            n: 2
        }, {
            name: "氢",
            n: 2
        },],
        t: 3,
        m: "化工设备",
    }, {
        s: [{
            name: "重燃油",
            n: 4
        }, {
            name: "硫化氢",
            n: 2
        },],
        q: [{
            name: "含硫重燃油",
            n: 4
        }, {
            name: "氢",
            n: 4
        },],
        t: 2,
        m: "化工设备",
    }, {
        s: [{
            name: "柴油",
            n: 4
        },],
        q: [{
            name: "轻燃油",
            n: 1
        }, {
            name: "重燃油",
            n: 3
        },],
        t: 3,
        m: "化工设备",
    }, {
        s: [{
            name: "一氧化碳",
            n: 2
        }, {
            name: "氢",
            n: 2
        },],
        q: [{
            name: "高能石墨",
            n: 2
        }, {
            name: "水",
            n: 2
        },],
        t: 4,
        m: "化工设备",
    }, {
        s: [{
            name: "二氧化碳",
            n: 2
        },],
        q: [{
            name: "高能石墨",
            n: 2
        }, {
            name: "氧",
            n: 4
        },],
        t: 2,
        m: "化工设备",
    }, {
        s: [{
            name: "甲醇",
            n: 1
        },],
        q: [{
            name: "一氧化碳",
            n: 1
        }, {
            name: "氢",
            n: 4
        },],
        t: 4,
        m: "化工设备",
    }, {
        s: [{
            name: "乙酸",
            n: 1
        },],
        q: [{
            name: "一氧化碳",
            n: 2
        }, {
            name: "氢",
            n: 4
        },],
        t: 4,
        m: "化工设备",
    }, {
        s: [{
            name: "乙酸甲酯",
            n: 1
        }, {
            name: "水",
            n: 1
        },],
        q: [{
            name: "乙酸",
            n: 1
        }, {
            name: "甲醇",
            n: 1
        },],
        t: 4,
        m: "化工设备",
    }, {
        s: [{
            name: "次氯酸",
            n: 2
        },],
        q: [{
            name: "氢氯酸",
            n: 2
        }, {
            name: "氧",
            n: 2
        },],
        t: 4,
        m: "化工设备",
    }, {
        s: [{
            name: "四硝基甲烷",
            n: 1
        }, {
            name: "高能石墨",
            n: 5
        }, {
            name: "水",
            n: 8
        },],
        q: [{
            name: "硝酸",
            n: 4
        }, {
            name: "乙酸甲酯",
            n: 2
        },],
        t: 3,
        m: "化工设备",
    }, {
        s: [{
            name: "硝基柴油",
            n: 1
        },],
        q: [{
            name: "四硝基甲烷",
            n: 2
        }, {
            name: "柴油",
            n: 2
        },],
        t: 8,
        m: "化工设备",
    }, {
        s: [{
            name: "偏二甲肼",
            n: 1
        }, {
            name: "氢氯酸",
            n: 2
        },],
        q: [{
            name: "次氯酸",
            n: 1
        }, {
            name: "氨",
            n: 2
        }, {
            name: "甲醇",
            n: 2
        },],
        t: 10,
        m: "化工设备",
    }, {
        s: [{
            name: "火箭燃料",
            n: 1
        },],
        q: [{
            name: "偏二甲肼",
            n: 4
        }, {
            name: "硝酸",
            n: 4
        },],
        t: 15,
        m: "化工设备",
    }, {
        s: [{
            name: "硝基柴油燃料棒",
            n: 1
        },],
        q: [{
            name: "空燃料棒",
            n: 1
        }, {
            name: "硝基柴油",
            n: 1
        }, {
            name: "氧",
            n: 10
        },],
        t: 10,
        m: "制造台",
    }, {
        s: [{
            name: "偏二甲肼燃料棒",
            n: 1
        },],
        q: [{
            name: "空燃料棒",
            n: 1
        }, {
            name: "偏二甲肼",
            n: 1
        }, {
            name: "硝酸",
            n: 1
        },],
        t: 10,
        m: "制造台",
    }, {
        s: [{
            name: "火箭燃料棒",
            n: 1
        },],
        q: [{
            name: "空燃料棒",
            n: 1
        }, {
            name: "火箭燃料",
            n: 1
        }, {
            name: "氧",
            n: 6
        },],
        t: 10,
        m: "制造台",
    }, {
        s: [{
            name: "微晶元件",
            n: 4
        },],
        q: [{
            name: "覆层塑料基板",
            n: 2
        }, {
            name: "低功率IC晶片",
            n: 4
        },],
        t: 2,
        m: "高精度装配线",
    }, {
        s: [{
            name: "处理器",
            n: 2
        },],
        q: [{
            name: "钛蚀刻覆层塑料基板",
            n: 1
        }, {
            name: "标准功率IC晶片",
            n: 2
        },],
        t: 2,
        m: "高精度装配线",
    }, {
        s: [{
            name: "量子芯片",
            n: 2
        },],
        q: [{
            name: "生物基板",
            n: 1
        }, {
            name: "高功率IC晶片",
            n: 2
        },],
        t: 3,
        m: "高精度装配线",
    }, {
        s: [{
            name: "硫酸",
            n: 2
        },],
        q: [{
            name: "硫化氢",
            n: 2
        }, {
            name: "氧",
            n: 8
        },],
        t: 2,
        m: "化工设备",
    }, {
        s: [{
            name: "量子储液罐",
            n: 1
        },],
        q: [{
            name: "钛合金",
            n: 16
        }, {
            name: "碳纳米管",
            n: 8
        }, {
            name: "量子芯片",
            n: 4
        }, {
            name: "钨强化玻璃",
            n: 4
        },],
        t: 15,
        m: "制造台",
    }, {
        s: [{
            name: "矿物处理厂",
            n: 1
        },],
        q: [{
            name: "基础机械组件",
            n: 3
        }, {
            name: "钢材",
            n: 6
        },],
        t: 3,
        m: "制造台",
    }, {
        s: [{
            name: "铁矿粉",
            n: 4
        },],
        q: [{
            name: "铁矿",
            n: 2
        },],
        t: 2,
        m: "矿物处理厂",
    }, {
        s: [{
            name: "铜矿粉",
            n: 4
        },],
        q: [{
            name: "铜矿",
            n: 2
        },],
        t: 2,
        m: "矿物处理厂",
    }, {
        s: [{
            name: "硅矿粉",
            n: 4
        },],
        q: [{
            name: "硅石",
            n: 2
        },],
        t: 2,
        m: "矿物处理厂",
    }, {
        s: [{
            name: "钛矿粉",
            n: 4
        },],
        q: [{
            name: "钛石",
            n: 2
        },],
        t: 2,
        m: "矿物处理厂",
    }, {
        s: [{
            name: "石粉",
            n: 4
        },],
        q: [{
            name: "石矿",
            n: 2
        },],
        t: 2,
        m: "矿物处理厂",
    }, {
        s: [{
            name: "煤矿粉",
            n: 4
        },],
        q: [{
            name: "煤矿",
            n: 2
        },],
        t: 2,
        m: "矿物处理厂",
    }, {
        s: [{
            name: "放射性矿物碎块",
            n: 4
        },],
        q: [{
            name: "硅石",
            n: 8
        }, {
            name: "氢氧化钠",
            n: 16
        },],
        t: 4,
        m: "矿物处理厂",
    }, {
        s: [{
            name: "铀矿",
            n: 1
        },],
        q: [{
            name: "放射性矿物碎块",
            n: 1
        }, {
            name: "氢氧化钠",
            n: 1
        },],
        t: 4,
        m: "矿物处理厂",
    }, {
        s: [{
            name: "钚矿",
            n: 1
        },],
        q: [{
            name: "放射性矿物碎块",
            n: 1
        }, {
            name: "氢氧化钠",
            n: 1
        },],
        t: 4,
        m: "矿物处理厂",
    }, {
        s: [{
            name: "高纯铀块",
            n: 1
        },],
        q: [{
            name: "铀矿",
            n: 1
        },],
        t: 2,
        m: "矿物处理厂",
    }, {
        s: [{
            name: "高纯钚块",
            n: 1
        },],
        q: [{
            name: "钚矿",
            n: 1
        },],
        t: 2,
        m: "矿物处理厂",
    }, {
        s: [{
            name: "铀燃料棒",
            n: 1
        },],
        q: [{
            name: "空燃料棒",
            n: 1
        }, {
            name: "高纯铀块",
            n: 4
        },],
        t: 10,
        m: "制造台",
    }, {
        s: [{
            name: "钚燃料棒",
            n: 1
        },],
        q: [{
            name: "空燃料棒",
            n: 1
        }, {
            name: "高纯钚块",
            n: 4
        },],
        t: 10,
        m: "制造台",
    }, {
        s: [{
            name: "MOX燃料棒",
            n: 1
        },],
        q: [{
            name: "钚燃料棒",
            n: 1
        }, {
            name: "铀燃料棒",
            n: 2
        },],
        t: 10,
        m: "制造台",
    }, {
        s: [{
            name: "铁块",
            n: 2
        },],
        q: [{
            name: "铁矿粉",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
    }, {
        s: [{
            name: "铜块",
            n: 2
        },],
        q: [{
            name: "铜矿粉",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
    }, {
        s: [{
            name: "高纯硅块",
            n: 2
        },],
        q: [{
            name: "硅矿粉",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
    }, {
        s: [{
            name: "钛块",
            n: 2
        },],
        q: [{
            name: "钛矿粉",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
    }, {
        s: [{
            name: "玻璃",
            n: 2
        },],
        q: [{
            name: "石粉",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
    }, {
        s: [{
            name: "高能石墨",
            n: 2
        },],
        q: [{
            name: "煤矿粉",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
    }, {
        s: [{
            name: "混凝土",
            n: 4
        },],
        q: [{
            name: "钢材",
            n: 8
        }, {
            name: "石粉",
            n: 16
        }, {
            name: "金刚石",
            n: 4
        }, {
            name: "水",
            n: 8
        },],
        t: 2,
        m: "制造台",
    }, {
        s: [{
            name: "天穹装配厂",
            n: 1
        },],
        q: [{
            name: "先进机械组件",
            n: 60
        }, {
            name: "钛合金",
            n: 180
        }, {
            name: "混凝土",
            n: 240
        }, {
            name: "制造台",
            n: 20
        }, {
            name: "量子芯片",
            n: 60
        },],
        t: 300,
        m: "高精度装配线",
    }, {
        s: [{
            name: "巨型粒子对撞机",
            n: 1
        },],
        q: [{
            name: "尖端机械组件",
            n: 30
        }, {
            name: "钨复合金属",
            n: 60
        }, {
            name: "混凝土",
            n: 360
        }, {
            name: "微型粒子对撞机",
            n: 10
        }, {
            name: "量子芯片",
            n: 120
        },],
        t: 300,
        m: "高精度装配线",
    }, {
        s: [{
            name: "聚束液体汲取设施",
            n: 1
        },],
        q: [{
            name: "尖端机械组件",
            n: 10
        }, {
            name: "钛合金",
            n: 30
        }, {
            name: "钨强化玻璃",
            n: 10
        }, {
            name: "量子芯片",
            n: 10
        },],
        t: 10,
        m: "高精度装配线",
    }, {
        s: [{
            name: "大气收集设施",
            n: 1
        },],
        q: [{
            name: "基础机械组件",
            n: 10
        }, {
            name: "钢材",
            n: 30
        }, {
            name: "混凝土",
            n: 20
        }, {
            name: "超级磁场环",
            n: 10
        },],
        t: 15,
        m: "制造台",
    }, {
        s: [{
            name: "苯酚",
            n: 1
        }, {
            name: "氢氯酸",
            n: 1
        },],
        q: [{
            name: "氯苯",
            n: 1
        }, {
            name: "水",
            n: 1
        },],
        t: 2,
        m: "化工设备",
        noExtra: true,
    }, {
        s: [{
            name: "硫粉",
            n: 2
        },],
        q: [{
            name: "煤矿粉",
            n: 4
        },],
        t: 2,
        m: "矿物处理厂",
    }, {
        s: [{
            name: "硫酸",
            n: 2
        },],
        q: [{
            name: "硫粉",
            n: 2
        }, {
            name: "水",
            n: 2
        }, {
            name: "氧",
            n: 6
        },],
        t: 2,
        m: "化工设备",
    }, {
        s: [{
            name: "通量矩阵",
            n: 1
        },],
        q: [{
            name: "电磁矩阵",
            n: 1
        }, {
            name: "能量矩阵",
            n: 1
        },],
        t: 3,
        m: "制造台",
        noExtra: true,
    }, {
        s: [{
            name: "空间矩阵",
            n: 1
        },],
        q: [{
            name: "结构矩阵",
            n: 1
        }, {
            name: "信息矩阵",
            n: 1
        },],
        t: 3,
        m: "制造台",
        noExtra: true,
    }, {
        s: [{
            name: "宇宙矩阵粗坯",
            n: 1
        },],
        q: [{
            name: "通量矩阵",
            n: 1
        }, {
            name: "空间矩阵",
            n: 1
        }, {
            name: "引力矩阵",
            n: 1
        },],
        t: 3,
        m: "制造台",
        noExtra: true,
    },
];

var energyData = {
    "矩阵研究站": 0.48,
    "制造台": 0.54,
    "电路蚀刻机": 1.08,
    "高精度装配线": 2.16,
    "精密制造厂": 120,
    "巨型化学反应釜": 30,
    "物质裂解塔": 30,
    "精密结构组装厂": 30,
    "天穹装配厂": 30,
    "矿物处理厂": 0.72,
    "电弧熔炉": 0.72,
    "位面熔炉": 1.44,
    "矿脉": 0.06999999999999999,
    "采矿机": 0.42,
    "大型采矿机": 2.94,
    "原油萃取站": 0.84,
    "抽水机": 0.3,
    "聚束液体汲取设施": 1.5,
    "精炼厂": 0.96,
    "化工厂": 0.72,
    "先进化学反应釜": 1.44,
    "微型粒子对撞机": 12,
    "巨型粒子对撞机": 60,
    "紧凑式回旋加速器": 480,
    "大气采集站": 0,
    "轨道采集器(巨冰)": 0,
    "轨道采集器(气态)": 0,
    "射线接收站": 0,
    "能量枢纽": 600
};

export {
    data,
    energyData
}