//配方 ，如果数据改变时有可能需要重置配方
var data = [
    /*
    {
        s: [{				s ：产物一(可能多产物)
            name: "重氢",	name ：产物名称
            n: 0.01			n ：数量(如果不提供就是1)
        }, {					产物二(可能多产物)
            name: "氢",		name ：产物名称
            n: 0.99			n ：数量(如果不提供就是1)
        }, ],
        group: "组件",		group ：产物分组
        m: "分馏塔",		m ：生产设备
        q: [{				q ：需求产物
            name: "氢",		name ：需求产物名称
            n: 1			n ：需求产物数量
        }],
        t: 1,				t ：生产时间(秒)
        noExtra: true,		noExtra : 提供true增产剂只允许加速 (如果不提供就是false)
    },
    */

    {
        s: [{
            name: "铁矿"
        }],
        q: [],
        m: "采矿机",
        t: 1,
    }, {
        s: [{
            name: "铜矿"
        }],
        q: [],
        m: "采矿机",
        t: 1,
    }, {
        s: [{
            name: "煤矿"
        }],
        q: [],
        m: "采矿机",
        t: 1,
    }, {
        s: [{
            name: "石矿"
        }],
        q: [],
        m: "采矿机",
        t: 1,
    }, {
        s: [{
            name: "钛石"
        }],
        q: [],
        m: "采矿机",
        t: 1,
    }, {
        s: [{
            name: "原油"
        }],
        q: [],
        m: "原油萃取站",
        t: 1,
    }, {
        s: [{
            name: "硅石"
        }],
        q: [],
        m: "采矿机",
        t: 1,
    }, {
        s: [{
            name: "可燃冰"
        }],
        group: "原料",
        m: "采矿机",
        q: [],
        t: 1,
    }, {
        s: [{
            name: "刺笋结晶"
        }],
        group: "原料",
        m: "采矿机",
        q: [],
        t: 1,
    }, {
        s: [{
            name: "有机晶体"
        }],
        group: "原料",
        m: "采矿机",
        q: [],
        t: 1,
    }, {
        s: [{
            name: "光栅石"
        }],
        q: [],
        m: "采矿机",
        t: 1,
    }, {
        s: [{
            name: "单极磁石"
        }],
        q: [],
        m: "采矿机",
        t: 1,
    }, {
        s: [{
            name: "金伯利矿石"
        }],
        q: [],
        m: "采矿机",
        t: 1,
    }, {
        s: [{
            name: "分形硅石"
        }],
        q: [],
        m: "采矿机",
        t: 1,
    }, {
        s: [{
            name: "钨矿"
        }],
        q: [],
        m: "采矿机",
        t: 1,
    }, {
        s: [{
            name: "氢"
        }],
        group: "原料",
        m: "轨道采集器",
        q: [],
        t: 1,
        noExtra: true,
    }, {
        s: [{
            name: "可燃冰"
        }],
        group: "原料",
        m: "轨道采集器",
        q: [],
        t: 1,
    }, {
        s: [{
            name: "氨"
        }],
        group: "原料",
        m: "轨道采集器",
        q: [],
        t: 1,
    }, {
        s: [{
            name: "氢"
        }],
        group: "原料",
        m: "轨道采集器2",
        q: [],
        t: 1,
    }, {
        s: [{
            name: "重氢"
        }],
        group: "原料",
        m: "轨道采集器2",
        q: [],
        t: 1,
        noExtra: true,
    }, {
        s: [{
            name: "氦"
        }],
        group: "原料",
        m: "轨道采集器2",
        q: [],
        t: 1,
        noExtra: true,
    }, {
        s: [{
            name: "氮"
        }],
        group: "原料",
        m: "轨道采集器3",
        q: [],
        t: 1,
        noExtra: true,
    }, {
        s: [{
            name: "氧"
        }],
        group: "原料",
        m: "轨道采集器3",
        q: [],
        t: 1,
        noExtra: true,
    }, {
        s: [{
            name: "一氧化碳"
        }],
        group: "原料",
        m: "轨道采集器3",
        q: [],
        t: 1,
        noExtra: true,
    }, {
        s: [{
            name: "二氧化碳"
        }],
        group: "原料",
        m: "轨道采集器3",
        q: [],
        t: 1,
        noExtra: true,
    }, {
        s: [{
            name: "水"
        }],
        q: [],
        m: "抽水设施",
        t: 1,
    }, {
        s: [{
            name: "硝酸",
            n: 1
        }],
        group: "原料",
        m: "抽水设施",
        q: [],
        t: 1,
    }, {
        s: [{
            name: "剧毒液体",
            n: 1
        }],
        m: "抽水设施",
        q: [],
        t: 1,
    }, {
        s: [{
            name: "盐水",
            n: 1
        }],
        group: "原料",
        m: "抽水设施",
        q: [],
        t: 1,
    }, {
        s: [{
            name: "临界光子",
            n: 1
        }],
        m: "射线接收站",
        q: [],
        t: 10,
    }, {
        s: [{
            name: "临界光子",
            n: 1
        }],
        m: "射线接收站",
        q: [{
            name: "引力透镜",
            n: 0.008333
        }],
        t: 5,
        noExtra: true,
    }, {
        s: [{
            name: "蓄电器（满）",
            n: 1
        }],
        m: "能量枢纽",
        q: [{
            name: "蓄电器",
            n: 1
        }],
        t: 4.5,
    }, {
        s: [{
            name: "铁块",
            n: 2
        },],
        q: [{
            name: "铁矿",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
        group: "产品",
    }, {
        s: [{
            name: "铜线圈",
            n: 2
        },],
        q: [{
            name: "铜块",
            n: 4
        },],
        t: 2,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "铜块",
            n: 2
        },],
        q: [{
            name: "铜矿",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
        group: "产品",
    }, {
        s: [{
            name: "石材",
            n: 2
        },],
        q: [{
            name: "石矿",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
        group: "产品",
    }, {
        s: [{
            name: "齿轮",
            n: 2
        },],
        q: [{
            name: "铁块",
            n: 2
        },],
        t: 2,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "电路板",
            n: 4
        },],
        q: [{
            name: "铁块",
            n: 2
        }, {
            name: "铜块",
            n: 2
        },],
        t: 2,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "风力涡轮机",
            n: 1
        },],
        q: [{
            name: "铁块",
            n: 4
        }, {
            name: "电动机",
            n: 1
        },],
        t: 2,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "电力感应塔",
            n: 2
        },],
        q: [{
            name: "铁块",
            n: 2
        }, {
            name: "铜线圈",
            n: 2
        },],
        t: 2,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "电磁矩阵",
            n: 1
        },],
        q: [{
            name: "铜线圈",
            n: 1
        }, {
            name: "电路板",
            n: 1
        },],
        t: 3,
        m: "科研设备",
        group: "矩阵",
    }, {
        s: [{
            name: "矩阵研究站",
            n: 1
        },],
        q: [{
            name: "基础机械组件",
            n: 1
        }, {
            name: "铁块",
            n: 4
        }, {
            name: "玻璃",
            n: 2
        }, {
            name: "电路板",
            n: 2
        },],
        t: 2,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "先驱者晶片",
            n: 1
        },],
        q: [{
            name: "三元精金",
            n: 40
        }, {
            name: "光子结晶",
            n: 20
        }, {
            name: "湿件主机",
            n: 10
        },],
        t: 90,
        m: "精密制造厂",
        group: "产品",
    }, {
        s: [{
            name: "电浆激发器",
            n: 1
        },],
        q: [{
            name: "玻璃",
            n: 1
        }, {
            name: "铜线圈",
            n: 2
        },],
        t: 2,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "无线输电塔",
            n: 1
        },],
        q: [{
            name: "电力感应塔",
            n: 1
        }, {
            name: "电浆激发器",
            n: 1
        },],
        t: 3,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "原油萃取站",
            n: 1
        },],
        q: [{
            name: "基础机械组件",
            n: 4
        }, {
            name: "钢材",
            n: 12
        }, {
            name: "电浆激发器",
            n: 4
        }, {
            name: "电路板",
            n: 4
        },],
        t: 4,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "精炼厂",
            n: 1
        },],
        q: [{
            name: "基础机械组件",
            n: 4
        }, {
            name: "钢材",
            n: 6
        }, {
            name: "电浆激发器",
            n: 4
        }, {
            name: "电路板",
            n: 2
        },],
        t: 2,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "氢",
            n: 2
        }, {
            name: "煤焦油",
            n: 1
        },],
        q: [{
            name: "原油",
            n: 2
        },],
        t: 2,
        m: "精炼设备",
        group: "产品",
    }, {
        s: [{
            name: "高能石墨",
            n: 2
        },],
        q: [{
            name: "煤矿",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
        group: "产品",
    }, {
        s: [{
            name: "能量矩阵",
            n: 1
        },],
        q: [{
            name: "高能石墨",
            n: 1
        }, {
            name: "氢",
            n: 1
        },],
        t: 3,
        m: "科研设备",
        group: "矩阵",
    }, {
        s: [{
            name: "氢燃料棒",
            n: 1
        },],
        q: [{
            name: "空燃料棒",
            n: 1
        }, {
            name: "氢燃料",
            n: 1
        }, {
            name: "氧",
            n: 10
        },],
        t: 10,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "推进器",
            n: 1
        },],
        q: [{
            name: "钢材",
            n: 1
        }, {
            name: "电磁涡轮",
            n: 1
        },],
        t: 2,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "加力推进器",
            n: 1
        },],
        q: [{
            name: "推进器",
            n: 2
        }, {
            name: "钛合金",
            n: 1
        }, {
            name: "超级磁场环",
            n: 1
        },],
        t: 4,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "化工厂",
            n: 1
        },],
        q: [{
            name: "基础机械组件",
            n: 2
        }, {
            name: "铁块",
            n: 4
        }, {
            name: "玻璃",
            n: 4
        }, {
            name: "电路板",
            n: 2
        },],
        t: 4,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "聚乙烯",
            n: 1
        },],
        q: [{
            name: "乙烯",
            n: 2
        }, {
            name: "氧",
            n: 2
        },],
        t: 2,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "硫酸",
            n: 2
        }, {
            name: "氢氧化钠",
            n: 4
        },],
        q: [{
            name: "硫酸钠",
            n: 2
        }, {
            name: "水",
            n: 4
        },],
        t: 2,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "精密制造厂",
            n: 1
        },],
        q: [{
            name: "高精度装配线",
            n: 60
        }, {
            name: "极速传送带",
            n: 240
        }, {
            name: "钨复合金属",
            n: 120
        }, {
            name: "超生物计算集群",
            n: 60
        },],
        t: 180,
        m: "高精度装配线",
        group: "建筑",
    }, {
        s: [{
            name: "紧凑式回旋加速器",
            n: 1
        },],
        q: [{
            name: "微型粒子对撞机",
            n: 40
        }, {
            name: "框架材料",
            n: 240
        }, {
            name: "超级磁场环",
            n: 120
        }, {
            name: "湿件主机",
            n: 5
        },],
        t: 180,
        m: "高精度装配线",
        group: "建筑",
    }, {
        s: [{
            name: "结构矩阵",
            n: 1
        },],
        q: [{
            name: "钛块",
            n: 1
        }, {
            name: "晶格硅",
            n: 1
        },],
        t: 3,
        m: "科研设备",
        group: "矩阵",
    }, {
        s: [{
            name: "卡西米尔晶体",
            n: 1
        },],
        q: [{
            name: "超级磁场环",
            n: 1
        }, {
            name: "石墨烯",
            n: 1
        }, {
            name: "氢",
            n: 2
        },],
        t: 2,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "物质裂解塔",
            n: 1
        },],
        q: [{
            name: "先进机械组件",
            n: 60
        }, {
            name: "钛合金",
            n: 180
        }, {
            name: "混凝土",
            n: 240
        }, {
            name: "位面熔炉",
            n: 10
        }, {
            name: "量子芯片",
            n: 60
        },],
        t: 300,
        m: "高精度装配线",
        group: "建筑",
    }, {
        s: [{
            name: "钛化玻璃",
            n: 1
        },],
        q: [{
            name: "玻璃",
            n: 2
        }, {
            name: "钛块",
            n: 1
        },],
        t: 4,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "石墨烯",
            n: 2
        },],
        q: [{
            name: "高能石墨",
            n: 4
        }, {
            name: "硫酸",
            n: 1
        },],
        t: 2,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "石墨烯",
            n: 2
        }, {
            name: "氢",
            n: 1
        },],
        q: [{
            name: "可燃冰",
            n: 2
        },],
        t: 2,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "碳纳米管",
            n: 2
        },],
        q: [{
            name: "石墨烯",
            n: 4
        },],
        t: 2,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "硅石",
            n: 2
        },],
        q: [{
            name: "石矿",
            n: 4
        },],
        t: 2,
        m: "冶炼设备",
        group: "产品",
    }, {
        s: [{
            name: "碳纳米管",
            n: 4
        },],
        q: [{
            name: "刺笋结晶",
            n: 2
        },],
        t: 2,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "粒子宽带",
            n: 1
        },],
        q: [{
            name: "碳纳米管",
            n: 1
        }, {
            name: "钛化玻璃",
            n: 1
        },],
        t: 4,
        m: "高精度装配线",
        group: "产品",
    }, {
        s: [{
            name: "晶格硅",
            n: 1
        },],
        q: [{
            name: "高纯硅块",
            n: 1
        },],
        t: 2,
        m: "冶炼设备",
        group: "产品",
    }, {
        s: [{
            name: "位面过滤器",
            n: 1
        },],
        q: [{
            name: "卡西米尔晶体",
            n: 1
        }, {
            name: "钛化玻璃",
            n: 2
        },],
        t: 6,
        m: "高精度装配线",
        group: "产品",
    }, {
        s: [{
            name: "微型粒子对撞机",
            n: 1
        },],
        q: [{
            name: "先进机械组件",
            n: 10
        }, {
            name: "钛合金",
            n: 20
        }, {
            name: "超级磁场环",
            n: 20
        }, {
            name: "量子芯片",
            n: 5
        },],
        t: 10,
        m: "高精度装配线",
        group: "建筑",
    }, {
        s: [{
            name: "重氢",
            n: 2
        },],
        q: [{
            name: "氢",
            n: 4
        },],
        t: 2,
        m: "粒子对撞机",
        group: "产品",
        noExtra: true,
    }, {
        s: [{
            name: "氘核燃料棒",
            n: 1
        },],
        q: [{
            name: "空燃料棒",
            n: 1
        }, {
            name: "氘核燃料",
            n: 1
        },],
        t: 10,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "湮灭约束球",
            n: 1
        },],
        q: [{
            name: "三元精金",
            n: 20
        }, {
            name: "反物质约束单元",
            n: 12
        }, {
            name: "超生物计算集群",
            n: 4
        },],
        t: 60,
        m: "精密制造厂",
        group: "产品",
    }, {
        s: [{
            name: "人造恒星",
            n: 1
        },],
        q: [{
            name: "尖端机械组件",
            n: 40
        }, {
            name: "钨复合金属",
            n: 60
        }, {
            name: "氦闪约束器",
            n: 16
        }, {
            name: "超级纳米电脑",
            n: 1
        },],
        t: 30,
        m: "高精度装配线",
        group: "建筑",
    }, {
        s: [{
            name: "反物质燃料棒",
            n: 1
        },],
        q: [{
            name: "空燃料棒",
            n: 1
        }, {
            name: "反物质燃料",
            n: 1
        },],
        t: 10,
        m: "制造台",
        group: "产品",
        noExtra: true,
    }, {
        s: [{
            name: "制造台",
            n: 2
        },],
        q: [{
            name: "基础机械组件",
            n: 2
        }, {
            name: "分拣器",
            n: 2
        }, {
            name: "电路板",
            n: 2
        },],
        t: 2,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "电路蚀刻机",
            n: 1
        },],
        q: [{
            name: "基础机械组件",
            n: 1
        }, {
            name: "玻璃",
            n: 1
        }, {
            name: "电路板",
            n: 1
        },],
        t: 2,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "高精度装配线",
            n: 1
        },],
        q: [{
            name: "先进机械组件",
            n: 6
        }, {
            name: "钛合金",
            n: 10
        }, {
            name: "极速分拣器",
            n: 12
        }, {
            name: "处理器",
            n: 6
        },],
        t: 6,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "采矿机",
            n: 1
        },],
        q: [{
            name: "基础机械组件",
            n: 1
        }, {
            name: "铁块",
            n: 2
        }, {
            name: "齿轮",
            n: 2
        },],
        t: 2,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "抽水机",
            n: 1
        },],
        q: [{
            name: "基础机械组件",
            n: 2
        }, {
            name: "铁块",
            n: 4
        }, {
            name: "电动机",
            n: 2
        },],
        t: 4,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "玻璃",
            n: 1
        },],
        q: [{
            name: "石矿",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
        group: "产品",
    }, {
        s: [{
            name: "处理器",
            n: 1
        },],
        q: [{
            name: "覆层塑料基板",
            n: 2
        }, {
            name: "微晶元件",
            n: 2
        }, {
            name: "低功率IC晶片",
            n: 2
        },],
        t: 4,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "量子芯片",
            n: 1
        },],
        q: [{
            name: "钛蚀刻覆层塑料基板",
            n: 2
        }, {
            name: "处理器",
            n: 2
        }, {
            name: "标准功率IC晶片",
            n: 2
        },],
        t: 6,
        m: "高精度装配线",
        group: "产品",
    }, {
        s: [{
            name: "微晶元件",
            n: 1
        },],
        q: [{
            name: "塑料基板",
            n: 2
        }, {
            name: "电路板",
            n: 2
        }, {
            name: "超低功率IC晶片",
            n: 2
        },],
        t: 2,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "巨型化学反应釜",
            n: 1
        },],
        q: [{
            name: "先进机械组件",
            n: 60
        }, {
            name: "钛合金",
            n: 180
        }, {
            name: "混凝土",
            n: 240
        }, {
            name: "先进化学反应釜",
            n: 10
        }, {
            name: "量子芯片",
            n: 60
        },],
        t: 300,
        m: "高精度装配线",
        group: "建筑",
    }, {
        s: [{
            name: "信息矩阵",
            n: 1
        },],
        q: [{
            name: "卡西米尔晶体",
            n: 1
        }, {
            name: "粒子宽带",
            n: 1
        },],
        t: 3,
        m: "科研设备",
        group: "矩阵",
    }, {
        s: [{
            name: "电弧熔炉",
            n: 1
        },],
        q: [{
            name: "基础机械组件",
            n: 1
        }, {
            name: "铁块",
            n: 2
        }, {
            name: "铜线圈",
            n: 2
        },],
        t: 2,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "三元精金",
            n: 1
        },],
        q: [{
            name: "钢材",
            n: 10
        }, {
            name: "钛合金",
            n: 10
        }, {
            name: "钨复合金属",
            n: 10
        },],
        t: 60,
        m: "紧凑式回旋加速器",
        group: "产品",
    }, {
        s: [{
            name: "高纯硅块",
            n: 2
        },],
        q: [{
            name: "硅石",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
        group: "产品",
    }, {
        s: [{
            name: "金刚石",
            n: 1
        },],
        q: [{
            name: "高能石墨",
            n: 1
        },],
        t: 2,
        m: "冶炼设备",
        group: "产品",
    }, {
        s: [{
            name: "金刚石",
            n: 4
        },],
        q: [{
            name: "金伯利矿石",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
        group: "产品",
    }, {
        s: [{
            name: "晶格硅",
            n: 4
        },],
        q: [{
            name: "分形硅石",
            n: 2
        },],
        t: 2,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "钢材",
            n: 1
        },],
        q: [{
            name: "铁块",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
        group: "产品",
    }, {
        s: [{
            name: "火力发电厂",
            n: 1
        },],
        q: [{
            name: "钢材",
            n: 10
        }, {
            name: "石材",
            n: 10
        }, {
            name: "电动机",
            n: 4
        }, {
            name: "电路板",
            n: 4
        },],
        t: 4,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "钛块",
            n: 2
        },],
        q: [{
            name: "钛石",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
        group: "产品",
    }, {
        s: [{
            name: "钛合金",
            n: 4
        },],
        q: [{
            name: "钢材",
            n: 4
        }, {
            name: "钛块",
            n: 4
        },],
        t: 6,
        m: "冶炼设备",
        group: "产品",
    }, {
        s: [{
            name: "太阳能板",
            n: 1
        },],
        q: [{
            name: "铁块",
            n: 4
        }, {
            name: "高纯硅块",
            n: 2
        }, {
            name: "电路板",
            n: 1
        },],
        t: 4,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "精密结构组装厂",
            n: 1
        },],
        q: [{
            name: "尖端机械组件",
            n: 30
        }, {
            name: "钨复合金属",
            n: 60
        }, {
            name: "混凝土",
            n: 360
        }, {
            name: "高精度装配线",
            n: 20
        }, {
            name: "量子芯片",
            n: 120
        },],
        t: 300,
        m: "高精度装配线",
        group: "建筑",
    }, {
        s: [{
            name: "物质分解设施",
            n: 1
        },],
        q: [{
            name: "先进机械组件",
            n: 20
        }, {
            name: "钛合金",
            n: 60
        }, {
            name: "混凝土",
            n: 40
        }, {
            name: "矿物处理厂",
            n: 20
        }, {
            name: "量子芯片",
            n: 10
        },],
        t: 120,
        m: "高精度装配线",
        group: "建筑",
    }, {
        s: [{
            name: "太阳帆",
            n: 6
        },],
        q: [{
            name: "聚苯并咪唑",
            n: 1
        }, {
            name: "处理器",
            n: 1
        },],
        t: 2,
        m: "高精度装配线",
        group: "产品",
    }, {
        s: [{
            name: "电磁轨道弹射器",
            n: 1
        },],
        q: [{
            name: "尖端机械组件",
            n: 20
        }, {
            name: "钨复合金属",
            n: 40
        }, {
            name: "超级磁场环",
            n: 20
        }, {
            name: "超级纳米电脑",
            n: 2
        },],
        t: 6,
        m: "高精度装配线",
        group: "建筑",
    }, {
        s: [{
            name: "射线接收站",
            n: 1
        },],
        q: [{
            name: "尖端机械组件",
            n: 2
        }, {
            name: "钨复合金属",
            n: 10
        }, {
            name: "太阳帆",
            n: 6
        }, {
            name: "量子芯片",
            n: 2
        },],
        t: 6,
        m: "高精度装配线",
        group: "建筑",
    }, {
        s: [{
            name: "广播式能源塔",
            n: 1
        },],
        q: [{
            name: "三元精金",
            n: 120
        }, {
            name: "尖端机械组件",
            n: 60
        }, {
            name: "光子结晶",
            n: 60
        }, {
            name: "先驱者晶片",
            n: 4
        },],
        t: 180,
        m: "精密制造厂",
        group: "建筑",
    }, {
        s: [{
            name: "反物质",
            n: 2
        }, {
            name: "氢",
            n: 2
        },],
        q: [{
            name: "临界光子",
            n: 2
        },],
        t: 2,
        m: "粒子对撞机",
        group: "产品",
        noExtra: true,
    }, {
        s: [{
            name: "宇宙矩阵",
            n: 1
        },],
        q: [{
            name: "宇宙矩阵粗坯",
            n: 1
        }, {
            name: "反物质",
            n: 1
        },],
        t: 3,
        m: "科研设备",
        group: "矩阵",
    }, {
        s: [{
            name: "蓄电器",
            n: 1
        },],
        q: [{
            name: "铁块",
            n: 4
        }, {
            name: "晶格硅",
            n: 2
        }, {
            name: "电路板",
            n: 1
        },],
        t: 4,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "能量枢纽",
            n: 1
        },],
        q: [{
            name: "先进机械组件",
            n: 4
        }, {
            name: "混凝土",
            n: 16
        }, {
            name: "处理器",
            n: 4
        },],
        t: 6,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "空间翘曲器",
            n: 1
        },],
        q: [{
            name: "引力透镜",
            n: 1
        },],
        t: 10,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "空间翘曲器",
            n: 8
        },],
        q: [{
            name: "引力矩阵",
            n: 1
        },],
        t: 10,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "框架材料",
            n: 1
        },],
        q: [{
            name: "钨复合金属",
            n: 1
        }, {
            name: "聚苯并咪唑",
            n: 1
        },],
        t: 4,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "戴森球组件",
            n: 1
        },],
        q: [{
            name: "框架材料",
            n: 1
        }, {
            name: "太阳帆",
            n: 1
        },],
        t: 6,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "垂直发射井",
            n: 1
        },],
        q: [{
            name: "尖端机械组件",
            n: 20
        }, {
            name: "钨复合金属",
            n: 40
        }, {
            name: "钨强化玻璃",
            n: 20
        }, {
            name: "超级纳米电脑",
            n: 8
        },],
        t: 15,
        m: "高精度装配线",
        group: "建筑",
    }, {
        s: [{
            name: "小型运载火箭",
            n: 1
        },],
        q: [{
            name: "戴森球组件",
            n: 4
        }, {
            name: "量子芯片",
            n: 1
        }, {
            name: "加力推进器",
            n: 2
        },],
        t: 10,
        m: "高精度装配线",
        group: "产品",
    }, {
        s: [{
            name: "传送带",
            n: 6
        },],
        q: [{
            name: "铁块",
            n: 2
        }, {
            name: "电动机",
            n: 2
        },],
        t: 2,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "分拣器",
            n: 2
        },],
        q: [{
            name: "铁块",
            n: 2
        }, {
            name: "电动机",
            n: 2
        },],
        t: 2,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "小型储物仓",
            n: 1
        },],
        q: [{
            name: "铁块",
            n: 2
        }, {
            name: "石材",
            n: 2
        },],
        t: 2,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "四向分流器",
            n: 1
        },],
        q: [{
            name: "铁块",
            n: 1
        }, {
            name: "传送带",
            n: 1
        },],
        t: 2,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "高速分拣器",
            n: 4
        },],
        q: [{
            name: "分拣器",
            n: 4
        }, {
            name: "电磁涡轮",
            n: 2
        },],
        t: 2,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "高速传送带",
            n: 6
        },],
        q: [{
            name: "传送带",
            n: 6
        }, {
            name: "电磁涡轮",
            n: 2
        },],
        t: 2,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "极速分拣器",
            n: 4
        },],
        q: [{
            name: "高速分拣器",
            n: 4
        }, {
            name: "超级磁场环",
            n: 2
        },],
        t: 2,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "大型储物仓",
            n: 1
        },],
        q: [{
            name: "铁块",
            n: 4
        }, {
            name: "石材",
            n: 4
        },],
        t: 4,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "极速传送带",
            n: 6
        },],
        q: [{
            name: "高速传送带",
            n: 6
        }, {
            name: "超级磁场环",
            n: 2
        },],
        t: 2,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "物流运输站",
            n: 1
        },],
        q: [{
            name: "基础机械组件",
            n: 10
        }, {
            name: "钢材",
            n: 30
        }, {
            name: "混凝土",
            n: 20
        }, {
            name: "微晶元件",
            n: 5
        },],
        t: 15,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "物流运输机",
            n: 1
        },],
        q: [{
            name: "铁块",
            n: 4
        }, {
            name: "推进器",
            n: 2
        },],
        t: 10,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "星际物流运输站",
            n: 1
        },],
        q: [{
            name: "先进机械组件",
            n: 20
        }, {
            name: "钛合金",
            n: 60
        }, {
            name: "混凝土",
            n: 40
        }, {
            name: "处理器",
            n: 2
        },],
        t: 30,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "星际物流运输船",
            n: 1
        },],
        q: [{
            name: "钛合金",
            n: 8
        }, {
            name: "加力推进器",
            n: 2
        },],
        t: 15,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "电动机",
            n: 1
        },],
        q: [{
            name: "铁块",
            n: 1
        }, {
            name: "铜线圈",
            n: 1
        },],
        t: 2,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "电磁涡轮",
            n: 1
        },],
        q: [{
            name: "电动机",
            n: 1
        }, {
            name: "石墨线圈",
            n: 1
        },],
        t: 2,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "氘氦混合聚变燃料棒",
            n: 1
        },],
        q: [{
            name: "氘核燃料棒",
            n: 1
        }, {
            name: "氦三燃料棒",
            n: 1
        }, {
            name: "氦闪约束器",
            n: 1
        },],
        t: 10,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "氦三燃料棒",
            n: 1
        },],
        q: [{
            name: "空燃料棒",
            n: 1
        }, {
            name: "氦三",
            n: 20
        },],
        t: 10,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "引力透镜",
            n: 1
        },],
        q: [{
            name: "超级磁场环",
            n: 1
        }, {
            name: "奇异物质",
            n: 1
        },],
        t: 4,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "引力矩阵",
            n: 1
        },],
        q: [{
            name: "引力透镜",
            n: 1
        }, {
            name: "位面过滤器",
            n: 1
        },],
        t: 3,
        m: "科研设备",
        group: "矩阵",
    }, {
        s: [{
            name: "超级磁场环",
            n: 1
        },],
        q: [{
            name: "电磁涡轮",
            n: 1
        }, {
            name: "钛线圈",
            n: 1
        },],
        t: 2,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "奇异物质",
            n: 1
        },],
        q: [{
            name: "卡西米尔晶体",
            n: 1
        }, {
            name: "重氢",
            n: 8
        },],
        t: 6,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "氦三",
            n: 1
        },],
        q: [{
            name: "氦",
            n: 4
        },],
        t: 4,
        m: "粒子对撞机",
        group: "产品",
    }, {
        s: [{
            name: "氦",
            n: 4
        },],
        q: [{
            name: "光栅石",
            n: 2
        },],
        t: 4,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "增产剂",
            n: 1
        },],
        q: [{
            name: "碳纳米管",
            n: 2
        }, {
            name: "三氯化铁",
            n: 1
        },],
        t: 2,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "喷涂机",
            n: 1
        },],
        q: [{
            name: "先进机械组件",
            n: 10
        }, {
            name: "混凝土",
            n: 10
        }, {
            name: "钛化玻璃",
            n: 4
        }, {
            name: "量子芯片",
            n: 2
        },],
        t: 4,
        m: "高精度装配线",
        group: "建筑",
    }, {
        s: [{
            name: "反物质能量炉",
            n: 1
        },],
        q: [{
            name: "三元精金",
            n: 240
        }, {
            name: "尖端机械组件",
            n: 120
        }, {
            name: "湮灭约束球",
            n: 120
        }, {
            name: "先驱者晶片",
            n: 8
        },],
        t: 180,
        m: "精密制造厂",
        group: "建筑",
    }, {
        s: [{
            name: "轨道采集器",
            n: 1
        },],
        q: [{
            name: "星际物流运输站",
            n: 1
        }, {
            name: "超级磁场环",
            n: 20
        },],
        t: 30,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "地基",
            n: 2
        },],
        q: [{
            name: "石材",
            n: 2
        }, {
            name: "钢材",
            n: 2
        },],
        t: 2,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "裂变能源发电站",
            n: 1
        },],
        q: [{
            name: "先进机械组件",
            n: 10
        }, {
            name: "钛合金",
            n: 30
        }, {
            name: "混凝土",
            n: 20
        }, {
            name: "超级磁场环",
            n: 16
        }, {
            name: "量子芯片",
            n: 4
        },],
        t: 10,
        m: "高精度装配线",
        group: "建筑",
    }, {
        s: [{
            name: "储液罐",
            n: 1
        },],
        q: [{
            name: "铁块",
            n: 2
        }, {
            name: "石材",
            n: 2
        }, {
            name: "玻璃",
            n: 2
        },],
        t: 2,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "氦闪约束器",
            n: 1
        },],
        q: [{
            name: "钨复合金属",
            n: 8
        }, {
            name: "超级磁场环",
            n: 4
        }, {
            name: "量子芯片",
            n: 1
        },],
        t: 15,
        m: "高精度装配线",
        group: "产品",
    }, {
        s: [{
            name: "位面熔炉",
            n: 1
        },],
        q: [{
            name: "先进机械组件",
            n: 4
        }, {
            name: "钛合金",
            n: 8
        }, {
            name: "位面过滤器",
            n: 4
        },],
        t: 4,
        m: "高精度装配线",
        group: "建筑",
    }, {
        s: [{
            name: "流速监测器",
            n: 1
        },],
        q: [{
            name: "铁块",
            n: 1
        }, {
            name: "电路板",
            n: 1
        },],
        t: 2,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "地热发电站",
            n: 1
        },],
        q: [{
            name: "火力发电厂",
            n: 2
        }, {
            name: "钛合金",
            n: 16
        }, {
            name: "处理器",
            n: 4
        },],
        t: 6,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "大型采矿机",
            n: 1
        },],
        q: [{
            name: "尖端机械组件",
            n: 20
        }, {
            name: "钛合金",
            n: 60
        }, {
            name: "钨强化玻璃",
            n: 20
        }, {
            name: "量子芯片",
            n: 10
        },],
        t: 10,
        m: "高精度装配线",
        group: "建筑",
    }, {
        s: [{
            name: "自动集装机",
            n: 1
        },],
        q: [{
            name: "基础机械组件",
            n: 2
        }, {
            name: "传送带",
            n: 2
        }, {
            name: "电路板",
            n: 2
        },],
        t: 4,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "反物质约束单元",
            n: 1
        },],
        q: [{
            name: "框架材料",
            n: 8
        }, {
            name: "位面过滤器",
            n: 4
        }, {
            name: "超级磁场环",
            n: 4
        }, {
            name: "量子芯片",
            n: 2
        },],
        t: 30,
        m: "高精度装配线",
        group: "产品",
    }, {
        s: [{
            name: "物流配送器",
            n: 1
        },],
        q: [{
            name: "基础机械组件",
            n: 1
        }, {
            name: "钢材",
            n: 2
        }, {
            name: "电路板",
            n: 1
        },],
        t: 8,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "配送运输机",
            n: 1
        },],
        q: [{
            name: "铁块",
            n: 2
        }, {
            name: "电磁涡轮",
            n: 1
        }, {
            name: "电路板",
            n: 1
        },],
        t: 2,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "先进化学反应釜",
            n: 1
        },],
        q: [{
            name: "先进机械组件",
            n: 2
        }, {
            name: "钛化玻璃",
            n: 12
        }, {
            name: "钛合金",
            n: 12
        }, {
            name: "处理器",
            n: 6
        },],
        t: 10,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "乙烯",
            n: 3
        }, {
            name: "氯苯",
            n: 2
        }, {
            name: "甘油",
            n: 1
        },],
        q: [{
            name: "原油",
            n: 3
        },],
        t: 6,
        m: "精炼设备",
        group: "产品",
    }, {
        s: [{
            name: "氢",
            n: 4
        }, {
            name: "氧",
            n: 2
        },],
        q: [{
            name: "水",
            n: 2
        },],
        t: 2,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "氢氧化钠",
            n: 2
        }, {
            name: "氢氯酸",
            n: 2
        },],
        q: [{
            name: "盐水",
            n: 2
        },],
        t: 2,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "氯化钠",
            n: 1
        }, {
            name: "硝酸钠",
            n: 1
        }, {
            name: "硫酸钠",
            n: 1
        },],
        q: [{
            name: "石矿",
            n: 1
        },],
        t: 3,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "环氧氯丙烷",
            n: 1
        }, {
            name: "水",
            n: 2
        },],
        q: [{
            name: "甘油",
            n: 1
        }, {
            name: "氢氯酸",
            n: 1
        },],
        t: 2,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "盐水",
            n: 2
        },],
        q: [{
            name: "水",
            n: 2
        }, {
            name: "氯化钠",
            n: 2
        },],
        t: 2,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "双酚A",
            n: 1
        }, {
            name: "水",
            n: 1
        },],
        q: [{
            name: "氢氯酸",
            n: 1
        }, {
            name: "苯酚",
            n: 2
        }, {
            name: "丙酮",
            n: 1
        },],
        t: 2,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "硝酸",
            n: 2
        }, {
            name: "硫酸钠",
            n: 1
        },],
        q: [{
            name: "硝酸钠",
            n: 2
        }, {
            name: "硫酸",
            n: 1
        },],
        t: 2,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "二硝基氯苯",
            n: 2
        },],
        q: [{
            name: "硝酸",
            n: 2
        }, {
            name: "氯苯",
            n: 2
        },],
        t: 2,
        m: "先进化学反应釜",
        group: "产品",
    }, {
        s: [{
            name: "二氯联苯胺",
            n: 2
        },],
        q: [{
            name: "二硝基氯苯",
            n: 2
        }, {
            name: "铜块",
            n: 2
        },],
        t: 2,
        m: "先进化学反应釜",
        group: "产品",
    }, {
        s: [{
            name: "氨",
            n: 1
        },],
        q: [{
            name: "氮",
            n: 1
        }, {
            name: "氢",
            n: 3
        },],
        t: 2,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "二氨基联苯胺",
            n: 1
        }, {
            name: "氢氯酸",
            n: 2
        },],
        q: [{
            name: "二氯联苯胺",
            n: 1
        }, {
            name: "氨",
            n: 2
        },],
        t: 2,
        m: "先进化学反应釜",
        group: "产品",
    }, {
        s: [{
            name: "煤焦油",
            n: 2
        },],
        q: [{
            name: "煤矿",
            n: 2
        },],
        t: 2,
        m: "精炼设备",
        group: "产品",
    }, {
        s: [{
            name: "苯酚",
            n: 4
        }, {
            name: "二甲苯",
            n: 2
        }, {
            name: "丙酮",
            n: 2
        },],
        q: [{
            name: "煤焦油",
            n: 2
        },],
        t: 2,
        m: "精炼设备",
        group: "产品",
    }, {
        s: [{
            name: "邻苯二甲酸",
            n: 1
        }, {
            name: "水",
            n: 2
        },],
        q: [{
            name: "氧",
            n: 2
        }, {
            name: "二甲苯",
            n: 1
        },],
        t: 2,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "间苯二甲酸二苯酯",
            n: 2
        },],
        q: [{
            name: "苯酚",
            n: 4
        }, {
            name: "邻苯二甲酸",
            n: 2
        },],
        t: 2,
        m: "先进化学反应釜",
        group: "产品",
    }, {
        s: [{
            name: "三氯化铁",
            n: 4
        }, {
            name: "水",
            n: 6
        },],
        q: [{
            name: "氢氯酸",
            n: 12
        }, {
            name: "铁块",
            n: 4
        }, {
            name: "氧",
            n: 6
        },],
        t: 6,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "硝酸",
            n: 1
        }, {
            name: "水",
            n: 1
        },],
        q: [{
            name: "氨",
            n: 1
        }, {
            name: "氧",
            n: 4
        },],
        t: 6,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "一氧化碳",
            n: 2
        },],
        q: [{
            name: "二氧化碳",
            n: 1
        }, {
            name: "高能石墨",
            n: 1
        },],
        t: 2,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "原油",
            n: 1
        },],
        q: [{
            name: "二氧化碳",
            n: 12
        }, {
            name: "氢",
            n: 36
        },],
        t: 12,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "甘油",
            n: 1
        },],
        q: [{
            name: "一氧化碳",
            n: 3
        }, {
            name: "氢",
            n: 8
        },],
        t: 2,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "生物微晶元件",
            n: 1
        },],
        q: [{
            name: "生物基板",
            n: 2
        }, {
            name: "微晶元件",
            n: 2
        }, {
            name: "高功率IC晶片",
            n: 2
        },],
        t: 2,
        m: "高精度装配线",
        group: "产品",
    }, {
        s: [{
            name: "先进生物电路",
            n: 1
        },],
        q: [{
            name: "覆层生物基板",
            n: 2
        }, {
            name: "生物微晶元件",
            n: 2
        }, {
            name: "超高功率IC晶片",
            n: 2
        },],
        t: 4,
        m: "高精度装配线",
        group: "产品",
    }, {
        s: [{
            name: "超生物计算集群",
            n: 1
        },],
        q: [{
            name: "钨蚀刻覆层生物基板",
            n: 2
        }, {
            name: "先进生物电路",
            n: 2
        }, {
            name: "生物IC晶片",
            n: 2
        },],
        t: 6,
        m: "高精度装配线",
        group: "产品",
    }, {
        s: [{
            name: "生物神经纤维",
            n: 1
        },],
        q: [{
            name: "粒子宽带",
            n: 2
        }, {
            name: "活性生物纤维",
            n: 2
        }, {
            name: "钨强化玻璃",
            n: 2
        },],
        t: 4,
        m: "高精度装配线",
        group: "产品",
    }, {
        s: [{
            name: "超级纳米电脑",
            n: 1
        },],
        q: [{
            name: "钛合金",
            n: 50
        }, {
            name: "粒子宽带",
            n: 20
        }, {
            name: "量子芯片",
            n: 20
        },],
        t: 60,
        m: "高精度装配线",
        group: "产品",
    }, {
        s: [{
            name: "湿件主机",
            n: 1
        },],
        q: [{
            name: "钨复合金属",
            n: 60
        }, {
            name: "生物神经纤维",
            n: 40
        }, {
            name: "超生物计算集群",
            n: 40
        },],
        t: 90,
        m: "高精度装配线",
        group: "产品",
    }, {
        s: [{
            name: "塑料基板",
            n: 1
        },],
        q: [{
            name: "聚乙烯",
            n: 1
        }, {
            name: "硫酸",
            n: 1
        },],
        t: 2,
        m: "电路蚀刻机",
        group: "产品",
    }, {
        s: [{
            name: "覆层塑料基板",
            n: 1
        },],
        q: [{
            name: "塑料基板",
            n: 1
        }, {
            name: "环氧树脂",
            n: 2
        }, {
            name: "硫酸",
            n: 1
        },],
        t: 2,
        m: "电路蚀刻机",
        group: "产品",
    }, {
        s: [{
            name: "钛蚀刻覆层塑料基板",
            n: 1
        },],
        q: [{
            name: "覆层塑料基板",
            n: 1
        }, {
            name: "钛块",
            n: 2
        }, {
            name: "硫酸",
            n: 1
        },],
        t: 2,
        m: "电路蚀刻机",
        group: "产品",
    }, {
        s: [{
            name: "生物基板",
            n: 1
        },],
        q: [{
            name: "聚苯并咪唑",
            n: 2
        }, {
            name: "三氯化铁",
            n: 2
        },],
        t: 4,
        m: "电路蚀刻机",
        group: "产品",
    }, {
        s: [{
            name: "覆层生物基板",
            n: 1
        },],
        q: [{
            name: "生物基板",
            n: 1
        }, {
            name: "活性生物纤维",
            n: 2
        }, {
            name: "三氯化铁",
            n: 2
        },],
        t: 4,
        m: "电路蚀刻机",
        group: "产品",
    }, {
        s: [{
            name: "钨蚀刻覆层生物基板",
            n: 1
        },],
        q: [{
            name: "覆层生物基板",
            n: 1
        }, {
            name: "钨块",
            n: 2
        }, {
            name: "三氯化铁",
            n: 2
        },],
        t: 4,
        m: "电路蚀刻机",
        group: "产品",
    }, {
        s: [{
            name: "超低功率IC晶片",
            n: 12
        },],
        q: [{
            name: "硅晶圆",
            n: 1
        },],
        t: 2,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "低功率IC晶片",
            n: 12
        },],
        q: [{
            name: "硅晶圆",
            n: 1
        },],
        t: 2,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "标准功率IC晶片",
            n: 12
        },],
        q: [{
            name: "钛掺杂的硅晶圆",
            n: 1
        },],
        t: 2,
        m: "高精度装配线",
        group: "产品",
    }, {
        s: [{
            name: "高功率IC晶片",
            n: 12
        },],
        q: [{
            name: "钛掺杂的硅晶圆",
            n: 1
        },],
        t: 2,
        m: "高精度装配线",
        group: "产品",
    }, {
        s: [{
            name: "超高功率IC晶片",
            n: 12
        },],
        q: [{
            name: "钨掺杂的硅晶圆",
            n: 1
        },],
        t: 2,
        m: "高精度装配线",
        group: "产品",
    }, {
        s: [{
            name: "生物IC晶片",
            n: 12
        },],
        q: [{
            name: "钨掺杂的硅晶圆",
            n: 1
        },],
        t: 2,
        m: "高精度装配线",
        group: "产品",
    }, {
        s: [{
            name: "环氧树脂",
            n: 1
        }, {
            name: "盐水",
            n: 1
        },],
        q: [{
            name: "双酚A",
            n: 1
        }, {
            name: "环氧氯丙烷",
            n: 1
        }, {
            name: "氢氧化钠",
            n: 3
        },],
        t: 2,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "聚苯并咪唑",
            n: 1
        }, {
            name: "苯酚",
            n: 1
        },],
        q: [{
            name: "二氨基联苯胺",
            n: 1
        }, {
            name: "间苯二甲酸二苯酯",
            n: 1
        },],
        t: 2,
        m: "先进化学反应釜",
        group: "产品",
    }, {
        s: [{
            name: "钨矿",
            n: 1
        },],
        q: [{
            name: "钛石",
            n: 6
        }, {
            name: "硝酸",
            n: 2
        },],
        t: 3,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "钨块",
            n: 2
        },],
        q: [{
            name: "钨矿",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
        group: "产品",
    }, {
        s: [{
            name: "钨强化玻璃",
            n: 1
        },],
        q: [{
            name: "玻璃",
            n: 2
        }, {
            name: "钨块",
            n: 1
        },],
        t: 2,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "钨复合金属",
            n: 4
        },],
        q: [{
            name: "钢材",
            n: 2
        }, {
            name: "钛合金",
            n: 4
        }, {
            name: "钨块",
            n: 8
        },],
        t: 12,
        m: "冶炼设备",
        group: "产品",
    }, {
        s: [{
            name: "硅晶圆",
            n: 1
        },],
        q: [{
            name: "高纯硅块",
            n: 16
        },],
        t: 8,
        m: "冶炼设备",
        group: "产品",
    }, {
        s: [{
            name: "钛掺杂的硅晶圆",
            n: 2
        },],
        q: [{
            name: "高纯硅块",
            n: 64
        }, {
            name: "钛块",
            n: 16
        },],
        t: 8,
        m: "冶炼设备",
        group: "产品",
    }, {
        s: [{
            name: "钨掺杂的硅晶圆",
            n: 4
        },],
        q: [{
            name: "高纯硅块",
            n: 128
        }, {
            name: "钨块",
            n: 32
        },],
        t: 8,
        m: "冶炼设备",
        group: "产品",
    }, {
        s: [{
            name: "活性生物纤维",
            n: 1
        },],
        q: [{
            name: "有机晶体",
            n: 2
        },],
        t: 2,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "钛齿轮",
            n: 2
        },],
        q: [{
            name: "钛块",
            n: 2
        },],
        t: 2,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "钨齿轮",
            n: 2
        },],
        q: [{
            name: "钨块",
            n: 2
        },],
        t: 2,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "光子结晶",
            n: 1
        },],
        q: [{
            name: "临界光子",
            n: 10
        },],
        t: 60,
        m: "紧凑式回旋加速器",
        group: "产品",
    }, {
        s: [{
            name: "石墨线圈",
            n: 2
        },],
        q: [{
            name: "高能石墨",
            n: 4
        },],
        t: 2,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "钛线圈",
            n: 2
        },],
        q: [{
            name: "钛块",
            n: 4
        },],
        t: 2,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "基础机械组件",
            n: 1
        },],
        q: [{
            name: "铁块",
            n: 2
        }, {
            name: "齿轮",
            n: 2
        }, {
            name: "电路板",
            n: 1
        },],
        t: 2,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "先进机械组件",
            n: 1
        },],
        q: [{
            name: "基础机械组件",
            n: 2
        }, {
            name: "钛齿轮",
            n: 2
        }, {
            name: "处理器",
            n: 1
        },],
        t: 4,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "尖端机械组件",
            n: 1
        },],
        q: [{
            name: "先进机械组件",
            n: 2
        }, {
            name: "钨齿轮",
            n: 2
        }, {
            name: "量子芯片",
            n: 1
        },],
        t: 6,
        m: "高精度装配线",
        group: "产品",
    }, {
        s: [{
            name: "空燃料棒",
            n: 1
        },],
        q: [{
            name: "铁块",
            n: 1
        }, {
            name: "玻璃",
            n: 1
        },],
        t: 2,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "氢燃料",
            n: 1
        },],
        q: [{
            name: "氢",
            n: 12
        },],
        t: 2,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "氘核燃料",
            n: 1
        },],
        q: [{
            name: "重氢",
            n: 6
        },],
        t: 4,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "反物质燃料",
            n: 1
        },],
        q: [{
            name: "反物质",
            n: 6
        },],
        t: 6,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "反物质",
            n: 4
        },],
        q: [{
            name: "临界光子",
            n: 4
        },],
        t: 2,
        m: "粒子对撞机",
        group: "产品",
        noExtra: true,
    }, {
        s: [{
            name: "奇异物质",
            n: 1
        },],
        q: [{
            name: "金刚石",
            n: 1
        }, {
            name: "重氢",
            n: 4
        },],
        t: 3,
        m: "粒子对撞机",
        group: "产品",
    }, {
        s: [{
            name: "石墨烯",
            n: 4
        },],
        q: [{
            name: "可燃冰",
            n: 2
        },],
        t: 2,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "氢",
            n: 4
        },],
        q: [{
            name: "原油",
            n: 2
        },],
        t: 2,
        m: "精炼设备",
        group: "产品",
    }, {
        s: [{
            name: "硫酸",
            n: 1
        }, {
            name: "氨",
            n: 1
        }, {
            name: "氢氯酸",
            n: 1
        }, {
            name: "煤焦油",
            n: 1
        },],
        q: [{
            name: "剧毒液体",
            n: 2
        },],
        t: 2,
        m: "精炼设备",
        group: "产品",
    }, {
        s: [{
            name: "硅晶圆",
            n: 1
        },],
        q: [{
            name: "高纯硅块",
            n: 8
        }, {
            name: "光栅石",
            n: 4
        },],
        t: 4,
        m: "冶炼设备",
        group: "产品",
    }, {
        s: [{
            name: "钛掺杂的硅晶圆",
            n: 2
        },],
        q: [{
            name: "高纯硅块",
            n: 32
        }, {
            name: "钛块",
            n: 8
        }, {
            name: "光栅石",
            n: 8
        },],
        t: 4,
        m: "冶炼设备",
        group: "产品",
    }, {
        s: [{
            name: "钨掺杂的硅晶圆",
            n: 4
        },],
        q: [{
            name: "高纯硅块",
            n: 64
        }, {
            name: "钨块",
            n: 16
        }, {
            name: "光栅石",
            n: 16
        },],
        t: 4,
        m: "冶炼设备",
        group: "产品",
    }, {
        s: [{
            name: "聚苯并咪唑",
            n: 1
        },],
        q: [{
            name: "活性生物纤维",
            n: 12
        },],
        t: 12,
        m: "精炼设备",
        group: "产品",
    }, {
        s: [{
            name: "聚乙烯",
            n: 4
        },],
        q: [{
            name: "有机晶体",
            n: 1
        }, {
            name: "乙烯",
            n: 2
        }, {
            name: "氧",
            n: 2
        },],
        t: 2,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "处理器",
            n: 4
        },],
        q: [{
            name: "生物基板",
            n: 1
        }, {
            name: "高功率IC晶片",
            n: 2
        },],
        t: 3,
        m: "高精度装配线",
        group: "产品",
    }, {
        s: [{
            name: "含硫轻燃油",
            n: 1
        }, {
            name: "含硫重燃油",
            n: 3
        },],
        q: [{
            name: "原油",
            n: 1
        },],
        t: 4,
        m: "精炼设备",
        group: "产品",
    }, {
        s: [{
            name: "轻燃油",
            n: 2
        }, {
            name: "硫化氢",
            n: 1
        },],
        q: [{
            name: "含硫轻燃油",
            n: 2
        }, {
            name: "氢",
            n: 2
        },],
        t: 3,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "重燃油",
            n: 4
        }, {
            name: "硫化氢",
            n: 2
        },],
        q: [{
            name: "含硫重燃油",
            n: 4
        }, {
            name: "氢",
            n: 4
        },],
        t: 2,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "柴油",
            n: 4
        },],
        q: [{
            name: "轻燃油",
            n: 1
        }, {
            name: "重燃油",
            n: 3
        },],
        t: 3,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "一氧化碳",
            n: 2
        }, {
            name: "氢",
            n: 2
        },],
        q: [{
            name: "高能石墨",
            n: 2
        }, {
            name: "水",
            n: 2
        },],
        t: 4,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "二氧化碳",
            n: 2
        },],
        q: [{
            name: "高能石墨",
            n: 2
        }, {
            name: "氧",
            n: 4
        },],
        t: 2,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "甲醇",
            n: 1
        },],
        q: [{
            name: "一氧化碳",
            n: 1
        }, {
            name: "氢",
            n: 4
        },],
        t: 4,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "乙酸",
            n: 1
        },],
        q: [{
            name: "一氧化碳",
            n: 2
        }, {
            name: "氢",
            n: 4
        },],
        t: 4,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "乙酸甲酯",
            n: 1
        }, {
            name: "水",
            n: 1
        },],
        q: [{
            name: "乙酸",
            n: 1
        }, {
            name: "甲醇",
            n: 1
        },],
        t: 4,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "次氯酸",
            n: 2
        },],
        q: [{
            name: "氢氯酸",
            n: 2
        }, {
            name: "氧",
            n: 2
        },],
        t: 4,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "四硝基甲烷",
            n: 1
        }, {
            name: "高能石墨",
            n: 5
        }, {
            name: "水",
            n: 8
        },],
        q: [{
            name: "硝酸",
            n: 4
        }, {
            name: "乙酸甲酯",
            n: 2
        },],
        t: 3,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "硝基柴油",
            n: 1
        },],
        q: [{
            name: "四硝基甲烷",
            n: 2
        }, {
            name: "柴油",
            n: 2
        },],
        t: 8,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "偏二甲肼",
            n: 1
        }, {
            name: "氢氯酸",
            n: 2
        },],
        q: [{
            name: "次氯酸",
            n: 1
        }, {
            name: "氨",
            n: 2
        }, {
            name: "甲醇",
            n: 2
        },],
        t: 10,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "火箭燃料",
            n: 1
        },],
        q: [{
            name: "偏二甲肼",
            n: 4
        }, {
            name: "硝酸",
            n: 4
        },],
        t: 15,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "硝基柴油燃料棒",
            n: 1
        },],
        q: [{
            name: "空燃料棒",
            n: 1
        }, {
            name: "硝基柴油",
            n: 1
        }, {
            name: "氧",
            n: 10
        },],
        t: 10,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "偏二甲肼燃料棒",
            n: 1
        },],
        q: [{
            name: "空燃料棒",
            n: 1
        }, {
            name: "偏二甲肼",
            n: 1
        }, {
            name: "硝酸",
            n: 1
        },],
        t: 10,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "火箭燃料棒",
            n: 1
        },],
        q: [{
            name: "空燃料棒",
            n: 1
        }, {
            name: "火箭燃料",
            n: 1
        }, {
            name: "氧",
            n: 6
        },],
        t: 10,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "微晶元件",
            n: 4
        },],
        q: [{
            name: "覆层塑料基板",
            n: 2
        }, {
            name: "低功率IC晶片",
            n: 4
        },],
        t: 2,
        m: "高精度装配线",
        group: "产品",
    }, {
        s: [{
            name: "处理器",
            n: 2
        },],
        q: [{
            name: "钛蚀刻覆层塑料基板",
            n: 1
        }, {
            name: "标准功率IC晶片",
            n: 2
        },],
        t: 2,
        m: "高精度装配线",
        group: "产品",
    }, {
        s: [{
            name: "量子芯片",
            n: 2
        },],
        q: [{
            name: "生物基板",
            n: 1
        }, {
            name: "高功率IC晶片",
            n: 2
        },],
        t: 3,
        m: "高精度装配线",
        group: "产品",
    }, {
        s: [{
            name: "硫酸",
            n: 2
        },],
        q: [{
            name: "硫化氢",
            n: 2
        }, {
            name: "氧",
            n: 8
        },],
        t: 2,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "量子储液罐",
            n: 1
        },],
        q: [{
            name: "钛合金",
            n: 16
        }, {
            name: "碳纳米管",
            n: 8
        }, {
            name: "量子芯片",
            n: 4
        }, {
            name: "钨强化玻璃",
            n: 4
        },],
        t: 15,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "矿物处理厂",
            n: 1
        },],
        q: [{
            name: "基础机械组件",
            n: 3
        }, {
            name: "钢材",
            n: 6
        },],
        t: 3,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "铁矿粉",
            n: 4
        },],
        q: [{
            name: "铁矿",
            n: 2
        },],
        t: 2,
        m: "矿物处理厂",
        group: "产品",
    }, {
        s: [{
            name: "铜矿粉",
            n: 4
        },],
        q: [{
            name: "铜矿",
            n: 2
        },],
        t: 2,
        m: "矿物处理厂",
        group: "产品",
    }, {
        s: [{
            name: "硅矿粉",
            n: 4
        },],
        q: [{
            name: "硅石",
            n: 2
        },],
        t: 2,
        m: "矿物处理厂",
        group: "产品",
    }, {
        s: [{
            name: "钛矿粉",
            n: 4
        },],
        q: [{
            name: "钛石",
            n: 2
        },],
        t: 2,
        m: "矿物处理厂",
        group: "产品",
    }, {
        s: [{
            name: "石粉",
            n: 4
        },],
        q: [{
            name: "石矿",
            n: 2
        },],
        t: 2,
        m: "矿物处理厂",
        group: "产品",
    }, {
        s: [{
            name: "煤矿粉",
            n: 4
        },],
        q: [{
            name: "煤矿",
            n: 2
        },],
        t: 2,
        m: "矿物处理厂",
        group: "产品",
    }, {
        s: [{
            name: "放射性矿物碎块",
            n: 4
        },],
        q: [{
            name: "硅石",
            n: 8
        }, {
            name: "氢氧化钠",
            n: 16
        },],
        t: 4,
        m: "矿物处理厂",
        group: "产品",
    }, {
        s: [{
            name: "铀矿",
            n: 1
        },],
        q: [{
            name: "放射性矿物碎块",
            n: 1
        }, {
            name: "氢氧化钠",
            n: 1
        },],
        t: 4,
        m: "矿物处理厂",
        group: "产品",
    }, {
        s: [{
            name: "钚矿",
            n: 1
        },],
        q: [{
            name: "放射性矿物碎块",
            n: 1
        }, {
            name: "氢氧化钠",
            n: 1
        },],
        t: 4,
        m: "矿物处理厂",
        group: "产品",
    }, {
        s: [{
            name: "高纯铀块",
            n: 1
        },],
        q: [{
            name: "铀矿",
            n: 1
        },],
        t: 2,
        m: "矿物处理厂",
        group: "产品",
    }, {
        s: [{
            name: "高纯钚块",
            n: 1
        },],
        q: [{
            name: "钚矿",
            n: 1
        },],
        t: 2,
        m: "矿物处理厂",
        group: "产品",
    }, {
        s: [{
            name: "铀燃料棒",
            n: 1
        },],
        q: [{
            name: "空燃料棒",
            n: 1
        }, {
            name: "高纯铀块",
            n: 4
        },],
        t: 10,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "钚燃料棒",
            n: 1
        },],
        q: [{
            name: "空燃料棒",
            n: 1
        }, {
            name: "高纯钚块",
            n: 4
        },],
        t: 10,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "MOX燃料棒",
            n: 1
        },],
        q: [{
            name: "钚燃料棒",
            n: 1
        }, {
            name: "铀燃料棒",
            n: 2
        },],
        t: 10,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "铁块",
            n: 2
        },],
        q: [{
            name: "铁矿粉",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
        group: "产品",
    }, {
        s: [{
            name: "铜块",
            n: 2
        },],
        q: [{
            name: "铜矿粉",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
        group: "产品",
    }, {
        s: [{
            name: "高纯硅块",
            n: 2
        },],
        q: [{
            name: "硅矿粉",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
        group: "产品",
    }, {
        s: [{
            name: "钛块",
            n: 2
        },],
        q: [{
            name: "钛矿粉",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
        group: "产品",
    }, {
        s: [{
            name: "玻璃",
            n: 2
        },],
        q: [{
            name: "石粉",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
        group: "产品",
    }, {
        s: [{
            name: "高能石墨",
            n: 2
        },],
        q: [{
            name: "煤矿粉",
            n: 2
        },],
        t: 2,
        m: "冶炼设备",
        group: "产品",
    }, {
        s: [{
            name: "混凝土",
            n: 4
        },],
        q: [{
            name: "钢材",
            n: 8
        }, {
            name: "石粉",
            n: 16
        }, {
            name: "金刚石",
            n: 4
        }, {
            name: "水",
            n: 8
        },],
        t: 2,
        m: "制造台",
        group: "产品",
    }, {
        s: [{
            name: "天穹装配厂",
            n: 1
        },],
        q: [{
            name: "先进机械组件",
            n: 60
        }, {
            name: "钛合金",
            n: 180
        }, {
            name: "混凝土",
            n: 240
        }, {
            name: "制造台",
            n: 20
        }, {
            name: "量子芯片",
            n: 60
        },],
        t: 300,
        m: "高精度装配线",
        group: "建筑",
    }, {
        s: [{
            name: "巨型粒子对撞机",
            n: 1
        },],
        q: [{
            name: "尖端机械组件",
            n: 30
        }, {
            name: "钨复合金属",
            n: 60
        }, {
            name: "混凝土",
            n: 360
        }, {
            name: "微型粒子对撞机",
            n: 10
        }, {
            name: "量子芯片",
            n: 120
        },],
        t: 300,
        m: "高精度装配线",
        group: "建筑",
    }, {
        s: [{
            name: "聚束液体汲取设施",
            n: 1
        },],
        q: [{
            name: "尖端机械组件",
            n: 10
        }, {
            name: "钛合金",
            n: 30
        }, {
            name: "钨强化玻璃",
            n: 10
        }, {
            name: "量子芯片",
            n: 10
        },],
        t: 10,
        m: "高精度装配线",
        group: "建筑",
    }, {
        s: [{
            name: "大气收集设施",
            n: 1
        },],
        q: [{
            name: "基础机械组件",
            n: 10
        }, {
            name: "钢材",
            n: 30
        }, {
            name: "混凝土",
            n: 20
        }, {
            name: "超级磁场环",
            n: 10
        },],
        t: 15,
        m: "制造台",
        group: "建筑",
    }, {
        s: [{
            name: "苯酚",
            n: 1
        }, {
            name: "氢氯酸",
            n: 1
        },],
        q: [{
            name: "氯苯",
            n: 1
        }, {
            name: "水",
            n: 1
        },],
        t: 2,
        m: "化工设备",
        group: "产品",
        noExtra: true,
    }, {
        s: [{
            name: "硫粉",
            n: 2
        },],
        q: [{
            name: "煤矿粉",
            n: 4
        },],
        t: 2,
        m: "矿物处理厂",
        group: "产品",
    }, {
        s: [{
            name: "硫酸",
            n: 2
        },],
        q: [{
            name: "硫粉",
            n: 2
        }, {
            name: "水",
            n: 2
        }, {
            name: "氧",
            n: 6
        },],
        t: 2,
        m: "化工设备",
        group: "产品",
    }, {
        s: [{
            name: "稳定矩阵",
            n: 1
        },],
        q: [{
            name: "电磁矩阵",
            n: 1
        }, {
            name: "能量矩阵",
            n: 1
        },],
        t: 3,
        m: "制造台",
        group: "矩阵",
        noExtra: true,
    }, {
        s: [{
            name: "虚空矩阵",
            n: 1
        },],
        q: [{
            name: "结构矩阵",
            n: 1
        }, {
            name: "信息矩阵",
            n: 1
        },],
        t: 3,
        m: "制造台",
        group: "矩阵",
        noExtra: true,
    }, {
        s: [{
            name: "宇宙矩阵粗坯",
            n: 1
        },],
        q: [{
            name: "稳定矩阵",
            n: 1
        }, {
            name: "虚空矩阵",
            n: 1
        }, {
            name: "引力矩阵",
            n: 1
        },],
        t: 3,
        m: "制造台",
        group: "矩阵",
        noExtra: true,
    },
];

var energyData = {};
energyData["矩阵研究站"] = 0.48;
energyData["制造台"] = 0.54;
energyData["电路蚀刻机"] = 1.08;
energyData["高精度装配线"] = 2.16;
energyData["精密制造厂"] = 120;
energyData["天穹装配厂"] = energyData["精密结构组装厂"] = energyData["物质裂解塔"] = energyData["巨型化学反应釜"] = 30;
energyData["电弧熔炉"] = energyData["矿物处理厂"] = 0.72;
energyData["位面熔炉"] = 1.44;
energyData["矿脉"] = 0.42 / 6;
energyData["采矿机"] = 0.42;
energyData["大型采矿机"] = 2.94;
energyData["原油萃取站"] = 0.84;
energyData["抽水机"] = 0.3;
energyData["聚束液体汲取设施"] = 1.5;
energyData["精炼厂"] = 0.96;
energyData["化工厂"] = 0.72;
energyData["先进化学反应釜"] = 1.44;
energyData["微型粒子对撞机"] = 12;
energyData["巨型粒子对撞机"] = 60;
energyData["紧凑式回旋加速器"] = 480;
energyData["轨道采集器(气态)"] = energyData["轨道采集器(巨冰)"] = energyData["大气采集站"] = 0;
energyData["射线接收站"] = 0;
energyData["能量枢纽"] = 600;

var spaceData = {}; //占用格子
spaceData["矩阵研究站"] = 36 / 15; // 可叠加
spaceData["制造台"] = spaceData["电路蚀刻机"] = spaceData["高精度装配线"] = spaceData["精密制造厂"] = 16;
spaceData["天穹装配厂"] = spaceData["精密结构组装厂"] = spaceData["巨型化学反应釜"] = spaceData["物质裂解塔"] = spaceData["巨型粒子对撞机"] = 36;
spaceData["电弧熔炉"] = spaceData["位面熔炉"] = energyData["矿物处理厂"] = 16;
spaceData["精炼厂"] = 28;
spaceData["化工厂"] = spaceData["先进化学反应釜"] = 35;
spaceData["射线接收站"] = 24;
spaceData["能量枢纽"] = 64;
spaceData["微型粒子对撞机"] = spaceData["紧凑式回旋加速器"] = 45;

var defaultAccType = "增产剂";
var defaultAccValue = "无";
var version = "081";
var chemicalDouble = 1;

function f_initData() {
    $(data).each(function (i, item) {
        item.id = i; //配方的id，用index设置，data改变时应该重置配方

        var ms = [];
        if (item.m == "科研设备") {
            ms = [{ name: "矩阵研究站", speed: 1 }];
        }
        if (item.m == "制造台") {
            ms = [
                { name: "制造台", speed: 2 },
                { name: "天穹装配厂", speed: 40 },
            ];
        }
        if (item.m == "电路蚀刻机") {
            ms = [
                { name: "电路蚀刻机", speed: 2 },
                { name: "精密结构组装厂", speed: 40 },
            ];
        }
        if (item.m == "高精度装配线") {
            ms = [
                { name: "高精度装配线", speed: 2 },
                { name: "精密结构组装厂", speed: 40 },
            ];
        }
        if (item.m == "精密制造厂") {
            ms = [{ name: "精密制造厂", speed: 0.05 }];
        }
        if (item.m == "冶炼设备") {
            ms = [
                { name: "电弧熔炉", speed: 2 },
                { name: "位面熔炉", speed: 4 },
                { name: "物质裂解塔", speed: 40 },
            ];
        }
        if (item.m == "矿物处理厂") {
            ms = [
                { name: "矿物处理厂", speed: 2 },
                { name: "物质裂解塔", speed: 40 },
            ];
        }
        if (item.m == "采矿机") {
            ms = [
                { name: "采矿机", speed: 6 },
                { name: "大型采矿机", speed: 2 * 20 },
                { name: "矿脉", speed: 1 },
            ];
        }
        if (item.m == "能量枢纽") {
            ms = [{ name: "能量枢纽", speed: 1 }];
        }
        if (item.m == "原油萃取站") {
            ms = [{ name: "原油萃取站", speed: 2 }];
        }
        if (item.m == "抽水设施") {
            ms = [
                { name: "抽水机", speed: 100 },
                { name: "聚束液体汲取设施", speed: 500 },
            ];
        }
        if (item.m == "精炼设备") {
            ms = [
                { name: "精炼厂", speed: 2 + 2 * chemicalDouble },
                { name: "巨型化学反应釜", speed: 40 },
            ];
        }
        if (item.m == "化工设备") {
            ms = [
                { name: "化工厂", speed: 2 + 2 * chemicalDouble },
                { name: "巨型化学反应釜", speed: 40 },
            ];
        }
        if (item.m == "先进化学反应釜") {
            ms = [
                { name: "先进化学反应釜", speed: 2 + 2 * chemicalDouble },
                { name: "巨型化学反应釜", speed: 40 },
            ];
        }
        if (item.m == "粒子对撞机") {
            ms = [
                { name: "微型粒子对撞机", speed: 4 },
                { name: "巨型粒子对撞机", speed: 40 }
            ];
        }
        if (item.m == "紧凑式回旋加速器") {
            ms = [{ name: "紧凑式回旋加速器", speed: 0.1 }];
        }
        if (item.m == "轨道采集器") {
            ms = [{ name: "轨道采集器(巨冰)", speed: 1 }];
        }
        if (item.m == "轨道采集器2") {
            ms = [{ name: "轨道采集器(气态)", speed: 1 }];
        }
        if (item.m == "轨道采集器3") {
            ms = [{ name: "大气采集站", speed: 9 }];
        }
        if (item.m == "射线接收站") {
            ms = [{ name: "射线接收站", speed: 1 }];
        }
        item.mName = item.m;
        item.m = ms;
    });
    // console.log(data);
}
var pointLength = 1;
var settingsLocal = {}; //不存储cookie
var settings = {};
function saveData(key, value) {
    if (window.localStorage) {
        localStorage.setItem(key, value);
    } else {
        $.cookie(key, value);
    }
}
function getData(key) {
    if (window.localStorage) {
        return localStorage.getItem(key);
    } else {
        return $.cookie(key);
    }
}
function saveConfig() {
    saveData("machine_config" + version, JSON.stringify(config));
}
function loadConfig() {
    var json = getData("machine_config" + version);
    if (json) {
        eval("config = " + json);
    }
}
function saveSetting() {
    saveData("machine_settings" + version, JSON.stringify(settings));
}
function loadSetting() {
    var json = getData("machine_settings" + version);
    if (json) {
        eval("settings = " + json);
    }
}
//var settings_time = {};
// function saveSettingTime() {
//   saveData("machine_settings_time" + version, JSON.stringify(settings_time));
// }
function loadSettingTime() {
    var json = getData("machine_settings_time" + version);
    if (json) {
        eval("settings_time = " + json);
    }
}
var settings_pf = {}; //保存上次选择的默认配方
function saveSettingPf() {
    saveData("machine_settings_pf" + version, JSON.stringify(settings_pf));
}
function loadSettingPf() {
    var json = getData("machine_settings_pf" + version);
    if (json) {
        eval("settings_pf = " + json);
    }
}
var projects = [];
function saveSettingProjects() {
    saveData("settings_projects" + version, JSON.stringify(projects));
}
function loadSettingProjects() {
    var json = getData("settings_projects" + version);
    if (json) {
        eval("projects = " + json);
    }
}
//获取配方默认的机器
function getMachine(arg) {
    var item = typeof arg == "string" ? find(arg) : arg;
    if (!item) return null;
    var machine = (settings[item.id] || {}).m || null;
    if (machine != null) return machine;

    machine = (settingsLocal[item.id] || {}).m || null;
    if (machine != null) return machine;

    return item.m[0].name;
}
// 获取配方默认的增产剂等级
function getAccType(arg) {
    var item = typeof arg == "string" ? find(arg) : arg;
    if (!item) return null;
    var accType = (settings[item.id] || {}).accType || null;
    if (accType != null) return accType;

    accType = (settingsLocal[item.id] || {}).accType || null;
    if (accType != null) return accType;

    return null;
}
// 获取配方默认的增产剂效果
function getAccValue(arg) {
    var item = typeof arg == "string" ? find(arg) : arg;
    if (!item) return null;
    var accValue = (settings[item.id] || {}).accValue || null;
    if (accValue != null) return accValue;

    accValue = (settingsLocal[item.id] || {}).accValue || null;
    if (accValue != null) return accValue;

    return null;
}
//获取时间  参数
function getValue(arg) {
    var item = typeof arg == "string" ? find(arg) : arg;
    if (!item) return null;
    var machine = getMachine(item);
    var accType = getAccType(item),
        accValue = getAccValue(item);
    //   var speed = settings_time[machine];

    //   if (speed) {
    //     return {
    //       name: machine,
    //       t: item.t,
    //       speed: speed,
    //       time: item.t / speed,
    //       isChange: true,
    //       accType: accType,
    //       accValue: accValue,
    //     };
    //   }
    for (var i = 0; i < item.m.length; i++) {
        var m = item.m[i];
        if (m.name == machine) {
            return {
                name: m.name,
                t: item.t,
                speed: m.speed,
                time: item.t / m.speed,
                accType: accType,
                accValue: accValue,
            };
        }
    }
    m = item.m[0];
    return {
        name: m.name,
        t: item.t,
        speed: m.speed,
        time: item.t / m.speed,
        accType: accType,
        accValue: accValue,
    };
}

var currentItem = null;

//要计算的目标
var xqs = [];
//独立生产 [{ id :"配方id",number : 1 }] 配置了这个，将独立生产以后再计算其他
var singleMake = [];

var xqss = [];
var game_data = {};
var isDataLoaded = false;
$(function () {
    $.ajax({
        url: "./Scripts/data.json?v" + version,
        dataType: "json",
        timeout: 1000000,
        success: function (data) {
            game_data = data;
            isDataLoaded = true;
            f_initIcons();
        },
        error: function () {
            alert("游戏资源加载失败，图标将无法显示正常，请刷新再试");
        },
    });

    f_init();
});

function getGroup() {
    var groups = [];
    $(data).each(function (i, item) {
        if (!item.group) return;

        if ($.inArray(item.group, groups) == -1) {
            groups.push(item.group);
        }
    });
    return groups;
}

function f_fillData() {
    var names = [];

    $(getGroup()).each(function (i, group) {
        var jgroup = $("<optgroup label='" + group + "'></optgroup>");
        $(data).each(function (i, item) {
            var name = item.name;
            if (item.group == group) {
                for (var j = 0; j < item.s.length; j++) {
                    if ($.inArray(item.s[j].name, names) == -1) {
                        names.push(item.s[j].name);
                        jgroup.append(
                            "<option value='" +
                            item.s[j].name +
                            "'>" +
                            item.s[j].name +
                            "</option>"
                        );
                    }
                }
            }
        });
        $("#seldata").append(jgroup);
    });

    for (var i = 1; i < 200; i = i + 1) {
        $("#selmaince").append(
            "<option value='" + i + "'>需要" + i + "个设备</option>"
        );
    }
    //for (var i = 110; i < 1000; i = i + 10) {
    //    $("#selore").append("<option value='" + i / 100 + "'>" + i + "%</option>");
    //}
}
//找到这个物品的配方
function getPfs(name) {
    var pfs = [];
    for (var i = 0; i < data.length; i++) {
        var item = data[i];
        for (var j = 0; j < item.s.length; j++) {
            if (item.s[j].name == name) {
                var pf = $.extend(true, {}, item);
                pfs.push(pf);
            }
        }
    }
    return pfs;
}
function getPfsByQ(name) {
    var pfs = [];
    for (var i = 0; i < data.length; i++) {
        var item = data[i];
        for (var j = 0; item.q && j < item.q.length; j++) {
            if (item.q[j].name == name) {
                var pf = $.extend(true, {}, item);
                pfs.push(pf);
            }
        }
    }
    return pfs;
}
function getIconImg(name) {
    var title = [];
    if (name == "轨道采集器(气态)") name = "轨道采集器";
    if (name == "轨道采集器(巨冰)") name = "轨道采集器";
    if (icons[name]) {
        title.push(
            "<img class='sicon' src='data:image/png;base64," +
            icons[name] +
            "' title='" +
            name +
            "' />"
        );
    } else {
        title.push(name);
    }
    return title.join("");
}
function getIconShow(name, number) {
    var title = [];
    title.push(getIconImg(name));
    title.push("<sub>" + number + "</sub>");

    return title.join("");
}
// 获取加了加速剂后的实际速度
function getAccSpeed(type, value) {
    if (["增产", "加速"].indexOf(value) === -1) {
        return 1;
    }
    // 增产剂每种等级以及工作类型的增产效率，inc: 增产/acc: 加速
    var accSpeed = { inc: [1.25], acc: [2] };
    var type_index = ["增产剂"].indexOf(type);
    // 默认是Mk.Ⅰ（也是界面上默认的）
    type_index = type_index >= 0 ? type_index : 0;
    return value == "增产" ? accSpeed.inc[type_index] : accSpeed.acc[type_index];
}
function getPfTitle(item, info) {
    var title = [];
    var speed1_7 = parseFloat($("#speed1_7").val());

    for (var j = 0; j < item.q.length; j++) {
        title.push(getIconShow(item.q[j].name, item.q[j].n || 1));

        if (info && $("#showMaxOneBelt").get(0).checked) {
            var number =
                ((1800 / ((60 / (item.t || 1)) * info.speed * (item.q[j].n || 1))) *
                    speed1_7) /
                getAccSpeed(info.accType, info.accValue);
            // console.log(1+' '+speed1_7);
            title.push("<sub class='maxOneBelt'>" + number.toFixed(pointLength));
            title.push("</sub>");
        }
    }

    if (item.q.length) {
        title.push('<img class="to" src="./img/to.png" />');
    }
    for (var j = 0; j < item.s.length; j++) {
        title.push(getIconShow(item.s[j].name, item.s[j].n || 1));

        if (info && $("#showMaxOneBelt").get(0).checked) {
            var number =
                ((1800 / ((60 / (item.t || 1)) * info.speed * (item.s[j].n || 1))) *
                    speed1_7) /
                getAccSpeed(info.accType, info.accValue);
            // console.log(2+' '+speed1_7);
            title.push("<sub class='maxOneBelt'>" + number.toFixed(pointLength));
            title.push("</sub>");
        }
    }
    title.push("(" + (item.t || 1).toFixed(1) + "s)");

    return title.join(" ");
}

//找到这个物品的配方(同时赋值s[XX]里的 t 和 n )
function find(name) {
    function get(item) {
        for (var j = 0; j < item.s.length; j++) {
            if (item.s[j].name == name) {
                var o = $.extend(true, {}, item);
                $.extend(o, item.s[j]);
                return o;
            }
        }
    }

    var pf = settings_pf[name];
    if (pf) {
        console.log("find pf:" + pf)
        return get(data[parseInt(pf)]);
    }

    for (var i = 0; i < data.length; i++) {
        var item = data[i];
        for (var j = 0; j < item.s.length; j++) {
            if (item.s[j].name == name) {
                return get(item);
            }
        }
    }
}

function f_add3(name) {
    currentItem = find(name);
    var number = parseInt($("#txtnumber").val());
    var v = $("#selmaince").val();
    if (v) {
        // 设备数量支持增产剂计算
        var accType = (settings[currentItem.id] || {}).accType || defaultAccType;
        var accValue = (settings[currentItem.id] || {}).accValue || defaultAccValue;
        if (accValue == "增产" && currentItem.noExtra) accValue = "无";
        if (currentItem.q.length == 0) accValue = "无";

        var info = getValue(currentItem);
        for (var i = 0; i < currentItem.s.length; i++) {
            if (currentItem.s[i].name == name) {
                number =
                    ((parseInt(v) * 60) / (currentItem.t || 1)) *
                    info.speed *
                    (currentItem.s[i].n || 1);
            }
            number *= getAccSpeed(accType, accValue);
        }
    }

    addItem(currentItem, number);
}
function addItem(item, number) {
    xqs.push({
        item: item,
        number: number,
    });

    update_all();
}
// function removeItem(itemId) {
//     xqs = xqs.filter(function (one) { return one.item.id != itemId; });
//     update_all();
// }

var app = null;
function f_init() {
    app = new Vue({
        el: "#result",
        data: {
            totalEnergy: 0,
            totalSpace: 0,
            totalAcc: 0,
            total: [],
            xqs: [],
            icons: icons,
            items: [],
            items2: [],
            items0: [],
            ig_names: [],
            number_editor_index: -1,
            number_editor_number: 0,
        },
        methods: {
            //   speedChange: function (item) {
            //     settings_time[item.machineName] = parseFloat(item.speed);
            //     saveSettingTime();
            //     update_all();
            //   },

            onClickNumber: function (index) {
                if (this.xqs && this.xqs[index]) {
                    this.number_editor_index = index;
                    this.number_editor_number = this.xqs[index].number;
                    Vue.nextTick(() => {
                        if (this.$refs.input && this.$refs.input[0]) {
                            let input = this.$refs.input[0];
                            input.focus();
                        }
                    });
                }
            },

            submitEditorNumber: function () {
                if (this.xqs && this.xqs[this.number_editor_index]) {
                    if (
                        Number.isInteger(this.number_editor_number) &&
                        this.number_editor_number > 0
                    ) {
                        this.xqs[this.number_editor_index].number =
                            this.number_editor_number;
                        update_all();
                    }
                    this.number_editor_index = -1;
                }
            },

            cancelEditorNumber: function () {
                this.number_editor_index = -1;
            },

            removeItem: function (index) {
                if (this.xqs && this.xqs[index]) {
                    this.xqs.splice(index, 1);
                    update_all();
                }
            },
        },
    });
    f_initData();
    f_fillData();
    doSpeed1();
    update_all();
    loadSetting();
    loadSettingTime();
    loadSettingPf();
    loadSettingProjects();

    projectsUpdate();
    $("#chemicalDoubl").change(function () {
        chemicalDouble = !chemicalDouble;
        $(data).each(function () {
            if (this.m) {
                for (var i = 0; i < this.m.length; i++) {
                    if (["精炼厂", "化工厂", "先进化学反应釜"].includes(this.m[i].name)) {
                        this.m[i].speed = 2 + 2 * chemicalDouble;
                    }
                }
            }
        });
        update_all();
    })
    $("#btnAdd3").click(function () {
        f_add3($("#seldata").val());
    });
    $("#btnReset2").click(function () {
        settings = {};
        saveSetting();
        update_all();
    });

    //   $("#btnReset3").click(function () {
    //     settings_time = {};
    //     saveSettingTime();
    //     update_all();
    //   });
    $("#speed1_8").change(function () {
        $(data).each(function () {
            if (this.m) {
                for (var i = 0; i < this.m.length; i++) {
                    if (this.m[i].name == "大型采矿机") {
                        this.m[i].speed =
                            1 *
                            20 *
                            0.01 *
                            parseFloat($("#selore").val()) *
                            0.01 *
                            parseFloat($("#speed1_8").val());
                    }
                }
            }
        });
        doSpeed1();
        update_all();
    });
    $("#selore").change(function () {
        $(data).each(function () {
            if (this.m) {
                for (var i = 0; i < this.m.length; i++) {
                    if (this.m[i].name == "矿脉") {
                        this.m[i].speed = Math.min(
                            1 * 0.01 * parseFloat($("#selore").val()),
                            240
                        );
                    }
                    if (this.m[i].name == "采矿机") {
                        this.m[i].speed = Math.min(
                            6 * 0.01 * parseFloat($("#selore").val()),
                            240
                        );
                    }
                    if (this.m[i].name == "大型采矿机") {
                        this.m[i].speed =
                            2 *
                            20 *
                            0.01 *
                            parseFloat($("#selore").val()) *
                            0.01 *
                            parseFloat($("#speed1_8").val());
                    }
                    if (this.m[i].name == "抽水机") {
                        this.m[i].speed = Math.min(
                            (50 * 0.01 * parseFloat($("#selore").val())) / 60,
                            240
                        );
                    }
                    if (this.m[i].name == "聚束液体汲取设施") {
                        this.m[i].speed = Math.min(
                            (50 * 0.01 * parseFloat($("#selore").val())) / 60,
                            240
                        );
                    }
                    if (this.m[i].name == "原油萃取站") {
                        this.m[i].speed = Math.min(
                            (2 * 0.01 * (parseFloat($("#oilSpeed").val()) * parseFloat($("#selore").val()))) / 60,
                            240
                        );
                    }
                }
            }
        });
        doSpeed1();
        update_all();
    });
    $("#btnSetting").click(function () {
        $("#MoreSetting").toggle();
    });
    $("#showMaxOneBelt").change(function () {
        update_all();
    });
    $("#pointLength").change(function () {
        pointLength = parseInt($(this).val());
        update_all();
    });
    //   $("#fractionatorSpeed").change(function () {
    //     $(data).each(function () {
    //       if (this.m) {
    //         for (var i = 0; i < this.m.length; i++) {
    //           if (this.m[i].name == "分馏塔") {
    //             this.m[i].speed =
    //               parseFloat($("#fractionatorSpeed").val()) / (0.01 * 60);
    //           }
    //         }
    //       }
    //     });
    //     update_all();
    //   });
    $("#oilSpeed").change(function () {
        $(data).each(function () {
            if (this.m) {
                for (var i = 0; i < this.m.length; i++) {
                    if (this.m[i].name == "原油萃取站") {
                        this.m[i].speed = Math.min(
                            (2 * (parseFloat($("#oilSpeed").val()) * parseFloat($("#selore").val()))) / 60,
                            240
                        );
                    }
                }
            }
        });
        update_all();
    });
    //   $("#gzSpeed").change(function () {
    //     $(data).each(function () {
    //       if (this.s && this.s[0].name == "临界光子") {
    //         if (this.m) {
    //           for (var i = 0; i < this.m.length; i++) {
    //             if (this.m[i].name == "射线接收站") {
    //               this.t =
    //                 (60 / parseFloat($("#gzSpeed").val())) *
    //                 (this.q && this.q.length ? 0.5 : 1);
    //             }
    //           }
    //         }
    //       }
    //     });
    //     update_all();
    //   });

    /*产量：可燃冰 0.65/s 氢0.25/s
  每分钟采集物=60*产量*采矿作业速度*8（这是大佬量化表的现状）
  可燃冰 60*0.65*110%*8=343.2
  氢气 60*0.25*110%*8=132
  供电消耗是按产出物的总能量占比计算的
  供电占比=产量*能量/总能量
  可燃冰占比=0.65*4.8/（0.65*4.8+0.25*8）=60.9%
  氢气占比=0.25*8/（0.65*4.8+0.25*8）=39.1%
  每分钟供电消耗=60*采集器功率*供电占比/采集物能量
  可燃冰供电消耗=60*30*60.9%/4.8=228.5
  氢气供电消耗=60*30*39.1%/8=87.9
  实际产出=每分钟采集-供电消耗
  可燃冰=343.2-228.5=114.7
  氢气=132-87.9=44.1*/

    function doSpeed1() {
        var ore = parseFloat($("#selore").val());
        function getSum(value1, value2, value3, p1, p2, p3) {
            var sum = 0;
            sum = value1 * 0.01 * ore * 8;
            var per = (value1 * p1) / (value1 * p1 + value2 * p2 + value3 * p3);
            sum -= (30 * per) / p1;

            return sum;
        }
        $(data).each(function () {
            if (
                this.s && [
                    "氢", "重氢", "氦", "可燃冰",
                    "氨", "氮", "氧", "一氧化碳", "二氧化碳"
                ].includes(this.s[0].name)
            ) {
                if (this.m) {
                    var speed1_1 = parseFloat($("#speed1_1").val()); //氢(气态)
                    var speed1_2 = parseFloat($("#speed1_2").val()); //重氢
                    var speed1_3 = parseFloat($("#speed1_3").val()); //氦
                    var speed2_1 = parseFloat($("#speed2_1").val()); //氢(巨冰)
                    var speed2_2 = parseFloat($("#speed2_2").val()); //可燃冰
                    var speed2_3 = parseFloat($("#speed2_3").val()); //氨
                    var speed3_1 = parseFloat($("#speed3_1").val()); //氮
                    var speed3_2 = parseFloat($("#speed3_2").val()); //氧
                    var speed3_3 = parseFloat($("#speed3_3").val()); //一氧化碳
                    var speed3_4 = parseFloat($("#speed3_4").val()); //二氧化碳
                    for (var i = 0; i < this.m.length; i++) {
                        if (this.m[i].name == "轨道采集器(气态)") {
                            if (this.s[0].name == "氢") {
                                this.t = 1 / getSum(speed1_1, speed1_2, speed1_3, 9, 400, 0);
                                //console.log("T1:" + 60/this.t);
                            } else if (this.s[0].name == "重氢") {
                                this.t = 1 / getSum(speed1_2, speed1_1, speed1_3, 400, 9, 0);
                                //console.log("T2:" + 60/this.t);
                            } else if (this.s[0].name == "氦") {
                                this.t = 1 / (speed1_3 * 0.01 * ore * 8);
                                //console.log("T3:" + 60/this.t);
                            }
                        }
                        if (this.m[i].name == "轨道采集器(巨冰)") {
                            if (this.s[0].name == "氢") {
                                this.t = 1 / getSum(speed2_1, speed2_2, speed2_3, 9, 4.8, 6);
                                //console.log("T4:" + 60/this.t);
                            } else if (this.s[0].name == "可燃冰") {
                                this.t = 1 / getSum(speed2_2, speed2_1, speed2_3, 4.8, 9, 6);
                                //console.log("T5:" + 60/this.t);
                            } else if (this.s[0].name == "氨") {
                                this.t = 1 / getSum(speed2_3, speed2_2, speed2_1, 6, 4.8, 9);
                                //console.log("T6:" + 60/this.t);
                            }
                        }
                        if (this.m[i].name == "大气采集站") {
                            if (this.s[0].name == "氮") {
                                this.t = 1 / (speed3_1);
                            } else if (this.s[0].name == "氧") {
                                this.t = 1 / (speed3_2);
                            } else if (this.s[0].name == "一氧化碳") {
                                this.t = 1 / (speed3_3);
                            } else if (this.s[0].name == "二氧化碳") {
                                this.t = 1 / (speed3_4);
                            }
                        }
                    }
                }
            }
        });
    }

    $(".speed1").change(function () {
        doSpeed1();
        update_all();
    });

    $("#btnReset4").click(function () {
        settings_pf = {};
        saveSettingPf();
        update_all();
    });
    $("#btnReset5").click(function () {
        projects = [];
        saveSettingProjects();
        projectsUpdate();
    });
    $("#btnLoadProject").click(function () {
        var value = $("#selprojects").val();
        if (!value) return;
        for (var i = 0; i < projects.length; i++) {
            if (projects[i].name == value) {
                xqs = projects[i].value;
                singleMake = projects[i].singleMake || [];
                ig_names = projects[i].ig_names || [];
                settings = projects[i].settings || {};
                update_all();
                return;
            }
        }
    });
    $("#selmodein").change(function () {
        var value = $("#selmodein").val();
        $(data).each(function () {
            if (this.mName == "制造台") {
                settingsLocal[this.id] = settingsLocal[this.id] || {};
                settingsLocal[this.id].m = value;
            }
        });
        saveSetting();
        update_all();
    });
    $("#circuitEtching").change(function () {
        var value = $("#circuitEtching").val();
        $(data).each(function () {
            if (this.mName == "电路蚀刻机") {
                settingsLocal[this.id] = settingsLocal[this.id] || {};
                settingsLocal[this.id].m = value;
            }
        });
        saveSetting();
        update_all();
    });
    $("#highPrecision").change(function () {
        var value = $("#highPrecision").val();
        $(data).each(function () {
            if (this.mName == "高精度装配线") {
                settingsLocal[this.id] = settingsLocal[this.id] || {};
                settingsLocal[this.id].m = value;
            }
        });
        saveSetting();
        update_all();
    });
    $("#furnace").change(function () {
        var value = $("#furnace").val();
        $(data).each(function () {
            if (this.mName == "冶炼设备") {
                settingsLocal[this.id] = settingsLocal[this.id] || {};
                settingsLocal[this.id].m = value;
            }
        });
        saveSetting();
        update_all();
    });
    $("#mineralProcess").change(function () {
        var value = $("#mineralProcess").val();
        $(data).each(function () {
            if (this.mName == "矿物处理厂") {
                settingsLocal[this.id] = settingsLocal[this.id] || {};
                settingsLocal[this.id].m = value;
            }
        });
        saveSetting();
        update_all();
    });
    $("#pump").change(function () {
        var value = $("#pump").val();
        $(data).each(function () {
            if (this.mName == "抽水设施") {
                settingsLocal[this.id] = settingsLocal[this.id] || {};
                settingsLocal[this.id].m = value;
            }
        });
        saveSetting();
        update_all();
    });
    $("#chemical").change(function () {
        var value = $("#chemical").val();
        $(data).each(function () {
            if (this.mName == "化工设备") {
                settingsLocal[this.id] = settingsLocal[this.id] || {};
                settingsLocal[this.id].m = value;
            }
        });
        saveSetting();
        update_all();
    });
    $("#advancchemical").change(function () {
        var value = $("#advancchemical").val();
        $(data).each(function () {
            if (this.mName == "先进化学反应釜") {
                settingsLocal[this.id] = settingsLocal[this.id] || {};
                settingsLocal[this.id].m = value;
            }
        });
        saveSetting();
        update_all();
    });
    $("#accelerator").change(function () {
        var value = $("#accelerator").val();
        $(data).each(function () {
            if (this.mName == "粒子对撞机") {
                settingsLocal[this.id] = settingsLocal[this.id] || {};
                settingsLocal[this.id].m = value;
            }
        });
        saveSetting();
        update_all();
    });
    //   $("#accType").change(function () {
    //     defaultAccType = $("#accType").val();
    //     // 不知道为啥要写这个for
    //     for (var i in settings) {
    //       delete settings[i].accType;
    //     }
    //     $(data).each(function () {
    //       // TODO: 下面的初始化代码还能优化一下
    //       settingsLocal[this.id] = settingsLocal[this.id] || {};
    //       settingsLocal[this.id].accType = defaultAccType;
    //     });
    //     saveSetting();
    //     update_all();
    //   });
    $("#accValue").change(function () {
        defaultAccValue = $("#accValue").val();
        for (var i in settings) {
            delete settings[i].accValue;
        }
        $(data).each(function () {
            // TODO: 下面的初始化代码还能优化一下
            settingsLocal[this.id] = settingsLocal[this.id] || {};
            settingsLocal[this.id].accValue = defaultAccValue;
        });
        saveSetting();
        update_all();
    });
    $("#isMerge").change(function () {
        update_all();
    });
    $("#hideSource").change(function () {
        update_all();
    });
    $("#selfAcc").change(update_all);
    $(document).click(function (e) {
        var jname = null;
        if ($(e.target).is(".cell-name")) {
            jname = $(e.target);
        }
        if ($(e.target).parent().is(".cell-name")) {
            jname = $(e.target).parent();
        }
        if ($(e.target).parent().parent().is(".cell-name")) {
            jname = $(e.target).parent().parent();
        }
        if (jname) {
            var msgs = [];
            var name = jname.attr("data-name");
            msgs.push("<p>" + name + "</p>");
            msgs.push("<p>生产于：</p>");
            var pfs = getPfs(name);
            for (var i = 0; i < pfs.length; i++) {
                var title = getPfTitle(pfs[i]);
                msgs.push("<p><a class='pf pf2'>" + title + "</a></p>");
            }
            pfs = getPfsByQ(name);
            if (pfs && pfs.length) {
                msgs.push("<p>作为原料可生产：</p>");

                for (var i = 0; i < pfs.length; i++) {
                    var title = getPfTitle(pfs[i]);
                    msgs.push("<p><a class='pf pf2'>" + title + "</a></p>");
                }
            }

            jname.tips({
                side: 3, //1,2,3,4 分别代表 上右下左
                msg: msgs.join(""),
                color: "#FFF", //文字颜色，默认为白色
                bg: "#4A5C72", //背景色，默认为红色
                time: 2,
                x: 0,
                y: 0,
            });
        }
    });
}

var single_list = []; //独立生产
var xh_list = [];
var out_list = [];

function addXH(name, value) {
    for (var i = 0; i < xh_list.length; i++) {
        var item = xh_list[i];
        if (item.name == name) {
            item.value += value; //需求
            return;
        }
    }
    xh_list.push({ name: name, value: value });
}
function addAccTotal(name, value) {
    for (var i = 0; i < xh_list.length; i++) {
        var item = xh_list[i];
        if (item.name == name) {
            item.accTotal = (item.accTotal || 0) + value; //需求
            return;
        }
    }
}
function addOut(name, value) {
    for (var i = 0; i < out_list.length; i++) {
        var item = out_list[i];
        if (item.name == name) {
            item.value += value; //需求
            return;
        }
    }
    out_list.push({ name: name, value: value });
}
function findOut(name) {
    for (var i = 0; i < out_list.length; i++) {
        var item = out_list[i];
        if (item.name == name) {
            return item.value;
        }
    }
    return null;
}
//其他产出是否包括在原料里面(如某配方 原料和产物都有氢)
//在产物S中循环查找，，如有相同则返回产物名
function getSameNameWithSource(item, itemName) {
    for (var i = 0; i < item.s.length; i++) {
        if (item.s[i].name != itemName) {
            for (var j = 0; item.q && j < item.q.length; j++) {
                var q = item.q[j];
                if (q.name == item.s[i].name) {
                    return q.name;
                }
            }
        }
    }
    return null;
}
var ig_names = []; //排除的物品
//加载需求
function loadNumber(itemName, n) { //itemName: "盐水"，n: 60 (每分钟需求)
    try {
        if ($.inArray(itemName, ig_names) != -1) { //判断是否被排除
            return;
        }
        if ((itemName == "增产剂") && n < 0.1) {
            return;
        }
        var item = find(itemName);
        /*
        item = {
            "s": [{
              "name": "盐水",
              "n": 2
            }],
            "q": [{
              "name": "水",
              "n": 2
            }, {
              "name": "氯化钠",
              "n": 2
            }],
            "t": 2,
            "m": [{
              "name": "化工厂",
              "speed": 4
            }, {
              "name": "巨型化学反应釜",
              "speed": 40
            }],
            "group": "产品",
            "id": 160,
            "mName": "化工设备",
            "name": "盐水",
            "n": 2
        }*/
        var sameName = getSameNameWithSource(item, itemName); //检查产出是否包括在原料中
        if (sameName) {
            for (var i = 0; i < item.s.length; i++) {
                if (item.s[i].name == sameName) {
                    for (var j = 0; item.q && j < item.q.length; j++) {
                        var q = item.q[j];
                        if (q.name == sameName) {
                            var minNumber = Math.min(q.n || 1, item.s[i].n || 1);
                            q.n = (q.n || 1) - minNumber;
                            item.s[i].n = (item.s[i].n || 1) - minNumber; //抵消
                        }
                    }
                }
            }
        }

        addXH(itemName, n);
        for (var i = 0; i < item.s.length; i++) {
            if (item.s[i].name != itemName) {
                if (item.s[i].n === 0) continue;
                addOut(item.s[i].name, (-1 * n * (item.s[i].n || 1)) / (item.n || 1));
            }
        }
        var accType = (settings[item.id] || {}).accType || defaultAccType;
        var accValue = (settings[item.id] || {}).accValue || defaultAccValue;
        var accTotal = 0;
        for (var i = 0; item.q && i < item.q.length; i++) {
            var q = item.q[i];
            if ($.inArray(q.name, ig_names) != -1) {
                continue;
            }
            if (q.n === 0) continue;
            //如果配方产物和原料有相同的
            if (q.name == itemName) {
                //addXH(itemName, -1 * n * (q.n || 1) / (item.n || 1));
            } else {
                var r = (n * (q.n || 1)) / (item.n || 1);
                var v = 1,
                    tm = 0;
                if (accType == "增产剂") (v = 1.25), (tm = 60);
                // 自喷涂
                if ($("#selfAcc")[0].checked) tm = tm * v - 1;
                if (accValue == "增产" && item.noExtra) accValue = "无";
                if (item.q.length == 0) accValue = "无";

                if (accValue == "加速") {
                    accTotal += r / tm;
                    loadNumber(accType, r / tm);
                } else if (accValue == "增产") {
                    r /= v;
                    accTotal += r / tm;
                    loadNumber(accType, r / tm);
                }

                loadNumber(q.name, r);
            }
        }
        addAccTotal(itemName, accTotal);
    } catch (e) {
        //console.log(itemName);
        throw e;
    }
}
//处理多产出
// function getXhs(itemId) {
//   var xhs = [];
//   for (var i = 0; i < xh_list.length; i++) {
//     var xh = xh_list[i];
//     if (!xh.value) continue;
//     var itemName = xh.name;
//     var item = find(itemName);
//     if (item.id == itemId) xhs.push(xh);
//   }
//   return xhs;
// }
// function doMergeMul(xhs) {
//   var maxValue2Index = -1;
//   var max = 0;
//   for (var i = 0; i < xhs.length; i++) {
//     if (xhs[i].value2 > max) maxValue2Index = i;
//   }

//   for (var i = 0; i < xhs.length; i++) {
//     if (i != maxValue2Index && xhs[i].value2 > 0) {
//       var number = xhs[i].value;
//       xhs[i].value2 = 0;
//       var item = find(xhs[i].name);
//       for (var j = 0; j < item.s.length; j++) {
//         addOut(item.s[j].name, (number * (item.s[j].n || 1)) / (item.n || 1));
//       }
//     }
//   }
// }
// function mergeMul() {
//   var gs = [];
//   var ids = [];
//   for (var i = 0; i < xh_list.length; i++) {
//     var xh = xh_list[i];
//     if (!xh.value) continue;
//     var itemName = xh.name;
//     var item = find(itemName);
//     if ($.inArray(item.id, ids) != -1) continue;
//     var xhs = getXhs(item.id);

//     if (xhs.length > 1) {
//       gs.push(xhs);
//       ids.push(item.id);
//     }
//   }
//   // console.log(gs); //gs:分组
//   for (var i = 0; i < gs.length; i++) {
//     doMergeMul(gs[i]);
//   }
// }

function checkResult() {
    //当前设备数量是否会 出现几个产出都多余，比如氢-120 精炼油-120，那么应该把设备调整到合适数量
    function isOverflow(item, info, nn) {
        for (var j = 0; j < item.s.length; j++) {
            var x = findOut(item.s[j].name);
            if (x == null) return false;
            var mn = ((nn * 60) / item.t) * info.speed * (item.s[j].n || 1); //1分钟1个设备产量
            if (x > -1 * mn) return false;
        }
        return true;
    }

    for (var i = 0; i < xh_list.length; i++) {
        var number = xh_list[i].value;
        var item = find(xh_list[i].name);
        var info = getValue(item);
        var nn = 1;
        if (xh_list[i].value2 < 1) {
            nn = xh_list[i].value2;
        }

        while (isOverflow(item, info, nn) && xh_list[i].value2 > 0) {
            //直到满足条件

            if (xh_list[i].value2 < 1) {
                nn = xh_list[i].value2;
            }
            xh_list[i].value2 = xh_list[i].value2 - nn; //调整数量
            for (var j = 0; j < item.s.length; j++) {
                var mn = ((nn * 60) / item.t) * info.speed * (item.s[j].n || 1); //1分钟1个设备产量
                addOut(item.s[j].name, mn);
            }
            if (xh_list[i].value2 < 1) {
                nn = xh_list[i].value2;
            }
            //console.log(JSON.stringify(out_list));
        }
    }
}
function update_all() {
    //var outResult = [];
    xh_list = [];
    out_list = [];
    single_list = [];

    for (var m = 0; m < singleMake.length; m++) {
        var item = data[singleMake[m].id]; //配方
        var info = getValue(item);
        var times =
            (60 * parseInt(singleMake[m].number) * info.speed) / (item.t || 1);

        for (var i = 0; i < item.s.length; i++) {
            single_list.push({
                id: singleMake[m].id,
                number: singleMake[m].number,
                name: item.s[i].name,
                mName: info.name,
                value: times * (item.s[i].n || 1),
            });
            loadNumber(item.s[i].name, -1 * times * (item.s[i].n || 1));
        }
        for (var j = 0; item.q && j < item.q.length; j++) {
            loadNumber(item.q[j].name, times * (item.q[j].n || 1));
        }
    }
    for (var m = 0; m < xqs.length; m++) {
        var currentItem = xqs[m].item;
        loadNumber(currentItem.name, xqs[m].number);
    }

    function isXqs(name) {
        for (var m = 0; m < xqs.length; m++) {
            if (xqs[m].item.name == name) return true;
        }
        return false;
    }
    var items0 = [];
    var items = [];
    var items2 = [];

    for (var i = 0; i < xh_list.length; i++) {
        var xh = xh_list[i];
        if (!xh.value) continue;
        var itemName = xh.name;
        var item = find(itemName);
        var info = getValue(itemName);
        if (xh.value > 0) {
            xh.value2 = xh.value / (1 / info.time) / 60 / (item.n || 1);
            var accType = (settings[item.id] || {}).accType || defaultAccType;
            var accValue = (settings[item.id] || {}).accValue || defaultAccValue;
            if (accValue == "增产" && item.noExtra) accValue = "无";
            if (item.q.length == 0) accValue = "无";

            xh.value2 /= getAccSpeed(accType, accValue);
        }
    }
    //mergeMul();//处理合并 多个产出使用了同一个配方 ,暂时弃用，checkResult会处理这种情况
    checkResult(); //优化当前结果，遍历配方，如果 出现几个产出都多余，比如氢-120 精炼油-120，那么应该把设备调整到合适数量

    for (var i = 0; i < single_list.length; i++) {
        if (!single_list[i].value) continue;
        var item = data[single_list[i].id];
        var info = getValue(single_list[i].name);
        var outitem = {
            name: single_list[i].name,
            number1: single_list[i].value,
            number2: single_list[i].number,
            time: info.time.toFixed(pointLength),
            t: info.t.toFixed(pointLength),
            speed: info.speed.toFixed(pointLength),
            pfTitle: getPfTitle(item, info),
            mName: single_list[i].mName,
        };
        items0.push(outitem);
    }

    //for (var i = 0; i < out_list.length; i++) {
    //    addXH(out_list[i].name, out_list[i].value);
    //    out_list[i].value = 0;
    //}
    for (var i = 0; i < xh_list.length; i++) {
        var xh = xh_list[i];
        if (!xh.value) continue;
        var itemName = xh.name;
        var item = find(itemName);
        var info = getValue(itemName);
        if (xh.value < 0) {
            xh.value2 = 0;
        }
    }
    var total = [];
    var totalAcc = 0;
    function addTotal(name, value, s) {
        var energy = energyData[name] || 0;
        var space = spaceData[name] || 0;

        var accType = (s || {}).accType || defaultAccType;
        var accValue = (s || {}).accValue || defaultAccValue;
        if (accValue != "无") {
            if (accType == "增产剂") energy *= 2.5;
        }

        for (var i = 0; i < total.length; i++) {
            var item = total[i];

            if (!item.energy) item.energy = 0;
            if (!item.space) item.space = 0;
            if (item.name == name) {
                item.value += value;
                item.energy += energy * (value || 0);
                item.space += space * (value || 0);
                return;
            }
        }

        total.push({
            name: name,
            value: value,
            energy: energy * (value || 0),
            space: space * (value || 0),
        });
    }

    for (var i = 0; i < xh_list.length; i++) {
        if (!xh_list[i].value) continue;

        var item = find(xh_list[i].name);
        var info = getValue(xh_list[i].name);
        if ($("#hideSource").get(0).checked) {
            if (!item.q || !item.q.length) {
                continue;
            }
        }
        var img = getIconImg(info.name);
        if (img.indexOf("<img") == -1) {
            img = "X" + img;
        }
        var outitem = {
            name: xh_list[i].name,
            number1: xh_list[i].value.toFixed(0),
            number2: xh_list[i].value2 ? xh_list[i].value2.toFixed(pointLength) : "",
            number2full:
                img + (xh_list[i].value2 ? xh_list[i].value2.toFixed(pointLength) : ""),
            time: info.time.toFixed(pointLength),
            t: info.t.toFixed(pointLength),
            speed: info.speed.toFixed(pointLength),
            speedClass: info.isChange ? "time time2" : "time",
            rowClass: isXqs(xh_list[i].name) ? "xqsrow" : "",
            machineName: info.name,
            m: [],
            pf: [],
            accType: [],
            accValue: [],
            accTotal: (xh_list[i].accTotal || 0).toFixed(2),
        };
        if (!outitem.number2) outitem.number2full = "";
        if (xh_list[i].name == "太阳帆") {
            outitem.numberOther =
                "(可供" + getIconShow("电磁轨道弹射器", outitem.number1 / 20) + ")";
        }
        if (xh_list[i].name == "小型运载火箭") {
            outitem.numberOther =
                "(可供" + getIconShow("垂直发射井", outitem.number1 / 5) + ")";
        }
        addTotal(info.name, Math.ceil(outitem.number2), settings[item.id]);
        // 增产剂总和
        if (info.accValue != "无") {
            // TODO: 这里调用Math.ceil未必合理，增产剂一般放在总线起始处，所以应该在最终算出的总和处调用Math.ceil
            totalAcc += xh_list[i].accTotal || 0;
        }
        var pfds = getPfs(xh_list[i].name);

        for (var j = 0; j < pfds.length; j++) {
            var pf = {
                class: item.id == pfds[j].id ? "pf selected" : "pf",
                href:
                    item.id == pfds[j].id
                        ? "javascript:void(0)"
                        : 'javascript: selectPf("' + item.name + '","' + pfds[j].id + '")',
                title: getPfTitle(pfds[j], item.id == pfds[j].id ? info : null),
            };
            outitem.pf.push(pf);
        }
        console.log("item: " + item);
        console.log("info: " + info);
        for (var j = 0; j < item.m.length; j++) {
            var m = {
                class: info.name == item.m[j].name ? "m selected" : "m",
                itemName: item.name,
                href:
                    info.name == item.m[j].name
                        ? "javascript:void(0)"
                        : 'javascript: selectM("' + item.id + '","' + item.m[j].name + '")',
                name: item.m[j].name,
                title: "设备速度:" + item.m[j].speed.toFixed(pointLength),
                showName: item.m[j].name,
            };
            if (m.showName == "采矿机") {
                m.title += " 采矿机按6个矿脉计算(因所限传送带速度最高30)";
            }
            if (m.showName == "大型采矿机") {
                m.title += " 大型采矿机按20个矿脉计算";
            }
            if (m.showName == "矿脉") {
                m.title += " (速度最高30)";
            }
            outitem.m.push(m);
        }
        var accType = (settings[item.id] || {}).accType || defaultAccType;
        var accValue = (settings[item.id] || {}).accValue || defaultAccValue;
        if (accValue == "增产" && item.noExtra) accValue = "无";
        if (item.q.length == 0) accValue = "无";

        ["增产剂"].forEach(function (one) {
            outitem.accType.push({
                class: one == accType ? "m selected" : "m",
                itemName: item.name,
                href:
                    one == accType
                        ? "javascript:void(0)"
                        : 'javascript: selectAccType("' + item.id + '","' + one + '")',
                name: one,
                title: one,
                showName: one.replace("增产剂", ""),
            });
        });

        ["无", "加速", "增产"].forEach(function (one) {
            if (one != "无" && item.q.length == 0) return;
            if (one == "增产" && item.noExtra) return;
            outitem.accValue.push({
                class: one == accValue ? "m selected" : "m",
                itemName: item.name,
                href:
                    one == accValue
                        ? "javascript:void(0)"
                        : 'javascript: selectAccValue("' + item.id + '","' + one + '")',
                name: one,
                title: one,
                showName: one,
            });
        });

        items.push(outitem);
    }

    for (var i = 0; i < out_list.length; i++) {
        if (!out_list[i].value) continue;
        var item = find(out_list[i].name);
        var info = getValue(out_list[i].name);
        var outitem = {
            name: out_list[i].name,
            number1: out_list[i].value.toFixed(pointLength),
            number2: out_list[i].value2
                ? out_list[i].value2.toFixed(pointLength)
                : "",
            time: info.time.toFixed(pointLength),
            t: info.t.toFixed(pointLength),
            speed: info.speed.toFixed(pointLength),
            speedClass: info.isChange ? "time time2" : "time",
            rowClass: "outrow",
            m: [],
            pf: [],
        };
        items2.push(outitem);
    }
    app.items0 = items0;
    app.xqs = xqs;
    app.items = items;
    app.items2 = items2;
    app.total = total;
    app.ig_names = ig_names;
    var energy = 0;
    for (var i = 0; i < total.length; i++) {
        energy += total[i].energy || 0;
    }
    app.totalEnergy = energy.toFixed(pointLength);
    var space = 0;
    for (var i = 0; i < total.length; ++i) {
        space += total[i].space || 0;
    }
    app.totalSpace = space;
    app.totalAcc = totalAcc.toFixed(2);
}
function selectM(id, m) {
    settings[id] = settings[id] || {};
    settings[id].m = m;
    saveSetting();
    update_all();
}
function selectAccType(id, accType) {
    settings[id] = settings[id] || {};
    settings[id].accType = accType;
    saveSetting();
    update_all();
}
function selectAccValue(id, accValue) {
    settings[id] = settings[id] || {};
    settings[id].accValue = accValue;
    saveSetting();
    update_all();
}
function selectPf(name, value) {
    settings_pf[name] = parseInt(value);
    saveSettingPf();
    update_all();
}
function f_tag(obj) {
    var jrow = $(obj).parents("tr:first");
    if (jrow.hasClass("row-tag")) {
        jrow.removeClass("row-tag");
    } else {
        jrow.addClass("row-tag");
    }
}
function f_ig(obj) {
    var name = $(obj).attr("data-name");
    ig_names.push(name);

    update_all();
}
function f_ig_acc() {
    ["增产剂"].forEach(function (one) {
        if (ig_names.indexOf(one) < 0) ig_names.push(one);
    });
    update_all();
}
function f_reset() {
    xqs = [];
    singleMake = [];
    app.number_editor_index = -1;
    update_all();
}
function f_reset_ig() {
    ig_names = [];

    update_all();
}
function f_remove_ig(name) {
    ig_names = ig_names.filter(function (one) {
        return one != name;
    });
    update_all();
}
function projectsUpdate() {
    $("#selprojects").html("");
    $(projects).each(function () {
        $("#selprojects").append(
            "<option value='" + this.name + "'>" + this.name + "</option>"
        );
    });
    if (projects.length) {
        $("#projectdiv").show();
    } else {
        $("#projectdiv").hide();
    }
}
function f_save() {
    let index = 0;
    let product_settings = {};
    var name = prompt("输入方案名");
    if (!name) return;
    for (index = 0; index < projects.length; index++) {
        // 存在相同名称的方案
        if (projects[index].name == name) {
            // 用户取消保存
            if (!confirm(`已存在名为${name}的方案，继续保存将覆盖原方案`)) {
                return;
            }
            break;
        }
    }
    // TODO: 优化处理方案
    for (let item of app.items) {
        let product_setting = {};
        for (let accType of item.accType) {
            if (accType.class === "m selected") {
                product_setting.accType = accType.name;
            }
        }
        for (let accValue of item.accValue) {
            if (accValue.class === "m selected") {
                product_setting.accValue = accValue.name;
            }
        }
        for (let m of item.m) {
            if (m.class === "m selected") {
                product_setting.m = m.name;
            }
        }
        product_settings[find(item.name).id] = product_setting;
    }
    projects[index] = {
        name: name,
        singleMake: singleMake,
        ig_names: ig_names || [],
        value: xqs,
        // 增产剂和工厂类型设置
        settings: product_settings,
    };
    saveSettingProjects();
    projectsUpdate();
}
function f_add() {
    if (!isDataLoaded) {
        alert("游戏资源尚未加载完毕");
    }
    $("#UIselector").show();
}
function actions(that) {
    // console.log(that.value)
    if (!that.value) {
        return false;
    } else {
        window.open(that.value);
    }
}
function f_split(obj) {
    var name = $(obj).attr("data-name");

    $("#Split").html("<p>选择配方：</p>");
    var pfs = getPfs(name);
    if (pfs.length == 1) {
        alert("不存在多配方");
        return;
    }
    var selected = null;
    for (var i = 0; i < pfs.length; i++) {
        (function (i) {
            var jlink = $("<div class='split-pf'></div>");
            jlink.html(getPfTitle(pfs[i]));
            jlink.appendTo($("#Split")).click(function () {
                selected = pfs[i];
                $("#Split .split-pf").removeClass("split-pf-selected");
                jlink.addClass("split-pf-selected");
            });
        })(i);
    }
    $("#Split").append("<p>设备数量：</p>");
    $("#Split").append(
        "<div><input type='text' value='1' class='split-number' /></div>"
    );
    $("#Split").append("<div><button>确定</button> </div>");
    $("#Split")
        .find("button")
        .click(function () {
            if (!selected) {
                alert("未选择配方");
                return;
            }
            singleMake.push({
                id: selected.id,
                number: parseFloat($("#Split").find(":text").val()),
            });
            update_all();
            $("#Split").hide();
        });

    setTimeout(function () {
        $("#Split").show();
    }, 50);
}
var icons_define = {
    氢: [-1, 3, 7, "氢"],
    可燃冰: [-1, 2, 7, "可燃冰"],
};
var icons = {};
function f_initIcons() {
    var reg = /^(\d)-(\d{1,2})-(.*)+/;
    var game_data_icons = [game_data.icons1, game_data.icons2, game_data.icons3, game_data.icons4, game_data.icons5];
    for (var i = 0; i < game_data_icons.length; i++) {
        for (var j = 0; j < game_data_icons[i].length; j++) {
            var icon = game_data_icons[i][j];
            if (reg.test(icon.name)) {
                var x = icon.name.match(reg);
                icons[x[3]] = icon.value;
            } else {
                icons[icon.name] = icon.value;
            }
        }
    }
    app.icons = icons;
    $(document).click(function (e) {
        if (!$(e.target).closest("#UIselector").length) {
            $("#UIselector").hide();
        }
        if (!$(e.target).closest("#Split").length) {
            $("#Split").hide();
        }
    });
    $("#UIselector")
        .html(
            '<div id="selector" class="selector" style="width: ' +
            w +
            "px; height: " +
            h +
            'px"><div id="tabs"></div></div>'
        )
        .hide();
    var w = 680;
    var h = 300;

    var jimg1 = $(
        "<div class='tab selected'><img src='./img/component-icon.png'/></div>"
    ).appendTo("#tabs");
    var jimg2 = $(
        "<div class='tab'><img src='./img/factory-icon.png'/></div>"
    ).appendTo("#tabs");
    var jimg3 = $(
        "<div class='tab'><img src='./img/refin-icon.png'/></div>"
    ).appendTo("#tabs");
    var jimg4 = $(
        "<div class='tab'><img src='./img/chemical-icon.png'/></div>"
    ).appendTo("#tabs");
    var jimg5 = $(
        "<div class='tab'><img src='./img/computer-icon.png'/></div>"
    ).appendTo("#tabs");

    jimg1.click(function () {
        jicons2.removeClass("icons-selected");
        jicons3.removeClass("icons-selected");
        jicons4.removeClass("icons-selected");
        jicons5.removeClass("icons-selected");
        jicons1.addClass("icons-selected");
        jimg2.removeClass("selected");
        jimg3.removeClass("selected");
        jimg4.removeClass("selected");
        jimg5.removeClass("selected");
        jimg1.addClass("selected");
    });
    jimg2.click(function () {
        jicons1.removeClass("icons-selected");
        jicons3.removeClass("icons-selected");
        jicons4.removeClass("icons-selected");
        jicons5.removeClass("icons-selected");
        jicons2.addClass("icons-selected");
        jimg1.removeClass("selected");
        jimg3.removeClass("selected");
        jimg4.removeClass("selected");
        jimg5.removeClass("selected");
        jimg2.addClass("selected");
    });
    jimg3.click(function () {
        jicons1.removeClass("icons-selected");
        jicons2.removeClass("icons-selected");
        jicons4.removeClass("icons-selected");
        jicons5.removeClass("icons-selected");
        jicons3.addClass("icons-selected");
        jimg1.removeClass("selected");
        jimg2.removeClass("selected");
        jimg4.removeClass("selected");
        jimg5.removeClass("selected");
        jimg3.addClass("selected");
    });
    jimg4.click(function () {
        jicons1.removeClass("icons-selected");
        jicons2.removeClass("icons-selected");
        jicons3.removeClass("icons-selected");
        jicons5.removeClass("icons-selected");
        jicons4.addClass("icons-selected");
        jimg1.removeClass("selected");
        jimg2.removeClass("selected");
        jimg3.removeClass("selected");
        jimg5.removeClass("selected");
        jimg4.addClass("selected");
    });
    jimg5.click(function () {
        jicons1.removeClass("icons-selected");
        jicons2.removeClass("icons-selected");
        jicons3.removeClass("icons-selected");
        jicons4.removeClass("icons-selected");
        jicons5.addClass("icons-selected");
        jimg1.removeClass("selected");
        jimg2.removeClass("selected");
        jimg3.removeClass("selected");
        jimg4.removeClass("selected");
        jimg5.addClass("selected");
    });

    var jicons1 = $('<div class="icons icons-selected"></div>').appendTo("#selector");
    addIcons(jicons1, game_data.icons1);
    var jicons2 = $('<div class="icons"></div>').appendTo("#selector");
    addIcons(jicons2, game_data.icons2);
    var jicons3 = $('<div class="icons"></div>').appendTo("#selector");
    addIcons(jicons3, game_data.icons3);
    var jicons4 = $('<div class="icons"></div>').appendTo("#selector");
    addIcons(jicons4, game_data.icons4);
    var jicons5 = $('<div class="icons"></div>').appendTo("#selector");
    addIcons(jicons5, game_data.icons5);

    function addIcons(jicons, icons) {
        jicons.width(w).height(h);

        for (var i = 0; i < 7; i++) {
            var jrow = $("<div class='iconrow'></div>").appendTo(jicons);
            for (var j = 0; j < 17; j++) {
                var jicon = $("<div class='icon'><div class='s'></div></div>").appendTo(
                    jrow
                );
                jicon.click(function () {
                    var name = $(this).attr("data-name");
                    if (!name) return;
                    f_add3(name);
                    $("#UIselector").hide();
                });
            }
        }

        for (var i = 0; i < icons.length; i++) {
            var icon = icons[i];
            var reg = /^(\d)-(\d{1,2})-(.*)+/;
            var x = null;
            if (reg.test(icon.name)) {
                x = icon.name.match(reg);
            } else if (icons_define[icon.name]) {
                x = icons_define[icon.name];
            }
            if (x) {
                jicons
                    .find(">.iconrow:eq(" + (parseInt(x[1]) - 1) + ")")
                    .find(">.icon:eq(" + (parseInt(x[2]) - 1) + ")")
                    .html("")
                    .append("<img src='data:image/png;base64," + icon.value + "' />")
                    .attr("data-name", x[3])
                    .attr("title", x[3]);
            }
        }
    }
}